melpa/working/shen-elisp/shen-elisp.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="viewport" content="width=device-width, initial-scale=1" />
<title>Shen Elisp</title>
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Aditya Siram" />
</head>
<body>
<div id="content">
<h1 class="title">Shen Elisp</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. Package Details</a></li>
<li><a href="#orgheadline21">2. KLambda Primitives</a>
<ul>
<li><a href="#orgheadline2">2.1. Implementation Constants</a></li>
<li><a href="#orgheadline4">2.2. Symbols</a></li>
<li><a href="#orgheadline5">2.3. Assignments</a></li>
<li><a href="#orgheadline6">2.4. KLambda Constants</a></li>
<li><a href="#orgheadline7">2.5. Boolean Operations</a></li>
<li><a href="#orgheadline8">2.6. Lambdas</a></li>
<li><a href="#orgheadline9">2.7. Lets</a></li>
<li><a href="#orgheadline10">2.8. Defuns</a></li>
<li><a href="#orgheadline11">2.9. Other Generic Functions</a></li>
<li><a href="#orgheadline13">2.10. Lists</a></li>
<li><a href="#orgheadline15">2.11. Strings</a></li>
<li><a href="#orgheadline16">2.12. Error Handling</a></li>
<li><a href="#orgheadline17">2.13. Vectors</a></li>
<li><a href="#orgheadline18">2.14. Arithmetic Operations</a></li>
<li><a href="#orgheadline19">2.15. Time</a></li>
<li><a href="#orgheadline14">2.16. Streams and I/O</a></li>
</ul>
</li>
<li><a href="#orgheadline32">3. Utilities</a>
<ul>
<li><a href="#orgheadline22">3.1. Lookup</a></li>
<li><a href="#orgheadline23">3.2. Boolean Operations</a></li>
<li><a href="#orgheadline30">3.3. AST Utilities</a>
<ul>
<li><a href="#orgheadline24">3.3.1. AST Getter/Setter</a></li>
<li><a href="#orgheadline27">3.3.2. AST Search</a></li>
<li><a href="#orgheadline28">3.3.3. Path Utilities</a></li>
<li><a href="#orgheadline29">3.3.4. AST Modification</a></li>
</ul>
</li>
<li><a href="#orgheadline31">3.4. List Filtering</a></li>
</ul>
</li>
<li><a href="#orgheadline42">4. Rewriting The AST</a>
<ul>
<li><a href="#orgheadline33">4.1. Prefixing Utilities</a></li>
<li><a href="#orgheadline3">4.2. Walking The AST</a></li>
<li><a href="#orgheadline34">4.3. Function Application</a></li>
<li><a href="#orgheadline38">4.4. Finding Tail Calls</a></li>
<li><a href="#orgheadline39">4.5. Generating A TCO'ed Function</a></li>
<li><a href="#orgheadline40">4.6. Modifying The AST</a></li>
<li><a href="#orgheadline41">4.7. (Unused) Isolating and Filling</a></li>
</ul>
</li>
<li><a href="#orgheadline48">5. Optimizations</a>
<ul>
<li><a href="#orgheadline43">5.1. Consolidate Call Chains</a></li>
<li><a href="#orgheadline12">5.2. Consolidate Cons</a></li>
<li><a href="#orgheadline44">5.3. Consolidate @s</a></li>
<li><a href="#orgheadline45">5.4. Consolidate tl</a></li>
<li><a href="#orgheadline46">5.5. Add 1+'s</a></li>
<li><a href="#orgheadline47">5.6. Nil Comparisons To Null</a></li>
</ul>
</li>
<li><a href="#orgheadline49">6. Evaluate KLambda</a>
<ul>
<li><a href="#orgheadline52">6.1. Generate From Seed KLambda Files</a>
<ul>
<li><a href="#orgheadline50">6.1.1. Overrides</a></li>
<li><a href="#orgheadline51">6.1.2. Evaluating Bootstrapped KLambda</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgheadline53">7. Providing The Primitives</a></li>
<li><a href="#orgheadline59">8. Overlays</a>
<ul>
<li><a href="#orgheadline54">8.1. Symbol Table</a></li>
<li><a href="#orgheadline57">8.2. Repl</a>
<ul>
<li><a href="#orgheadline55">8.2.1. Questions</a></li>
<li><a href="#orgheadline56">8.2.2. Changing Directories</a></li>
</ul>
</li>
<li><a href="#orgheadline58">8.3. Provide it</a></li>
</ul>
</li>
<li><a href="#orgheadline20">9. Shen REPL</a>
<ul>
<li><a href="#orgheadline60">9.1. Credits</a></li>
<li><a href="#orgheadline61">9.2. Prompt</a></li>
<li><a href="#orgheadline62">9.3. Input Events</a></li>
<li><a href="#orgheadline63">9.4. Evaluating User Input</a></li>
<li><a href="#orgheadline64">9.5. The REPL Mode</a></li>
<li><a href="#orgheadline65">9.6. Starting the REPL</a></li>
<li><a href="#orgheadline66">9.7. Provide it</a></li>
</ul>
</li>
<li><a href="#orgheadline70">10. Bootstrap</a>
<ul>
<li><a href="#orgheadline67">10.1. Collecting KLambda files</a></li>
<li><a href="#orgheadline68">10.2. Modifying The Elisp Reader For KLambda</a></li>
<li><a href="#orgheadline69">10.3. Iterating over KLambda Files</a></li>
</ul>
</li>
<li><a href="#orgheadline71">11. The Runner</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> Package Details</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>define-package
  <span style="color: #666666;">"shen-elisp"</span>
  <span style="color: #666666;">"19.2-0.0.1"</span>
  <span style="color: #666666;">"Shen implementation in Elisp"</span>
  '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span>emacs <span style="color: #666666;">"24.3"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
  <span style="color: #333333; font-weight: bold;">:url</span> <span style="color: #666666;">"http://github.com/deech/shen-elisp"</span>
  <span style="color: #333333; font-weight: bold;">:keywords</span> '<span style="color: #7388d6;">(</span><span style="color: #666666;">"shen"</span> <span style="color: #666666;">"elisp"</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline21" class="outline-2">
<h2 id="orgheadline21"><span class="section-number-2">2</span> KLambda Primitives</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-orgheadline2" class="outline-3">
<h3 id="orgheadline2"><span class="section-number-3">2.1</span> Implementation Constants</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">-*- lexical-binding: t -*-</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/prefix</span> <span style="color: #666666;">"shen/"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">2.2</span> Symbols</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Symbols in KLambda (and Shen) are very much like symbols in Elisp :
</p>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/symbol-p</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>not <span style="color: #909183;">(</span>or <span style="color: #709870;">(</span>consp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>bufferp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>vectorp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>numberp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>stringp X<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
except for a few important differences:
</p>
<ol class="org-ol">
<li><p>
In KLambda (and Shen) symbols don't need to be quoted:
</p>
<pre class="example">
&gt; some-symbol
some-symbol
</pre>
<p>
whereras in Elisp they do:
</p>
<pre class="example">
&gt; some-symbol
*** Eval error ***  Symbol's value as variable is void: some-symbol
&gt; 'some-symbol
some-symbol
</pre></li>

<li><p>
When calling a symbol function in Shen you can
simply apply the arguments:
</p>
<pre class="example">
(defun call-f (f a b c) (f a b c)
</pre>
<p>
But in Elisp we need to use <code>funcall</code>:
</p>
<pre class="example">
(defun call-f (f a b c) (funcall f a b c)
</pre></li>
</ol>

<p>
To deal with these differences a <a href="#orgheadline3">pass</a> is taken over the KLambda ast (before
macroexpansion) that identifies symbols that requires quoting and function calls
that need to be applied correctly.
</p>

<p>
Interning a Shen symbol delegates to Elisp's <code>intern</code>:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/intern</span> <span style="color: #7388d6;">(</span>String<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>intern String<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<p>
as does <code>shen/symbol-&gt;string</code>:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/symbol-&gt;string</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>symbol-name X<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">2.3</span> Assignments</h3>
<div class="outline-text-3" id="text-2-3">
<ul class="org-ul">
<li>When setting and getting a variable, the name is prefixed to prevent the user from stomping over one that
already exists in the Emacs image.</li>
</ul>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/set</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>set <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>concat shen/prefix <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s"</span> X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> Y<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/value</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex
          <span style="color: #909183;">(</span>symbol-value <span style="color: #709870;">(</span>intern <span style="color: #907373;">(</span>concat shen/prefix <span style="color: #6276ba;">(</span>format <span style="color: #666666;">"%s"</span> X<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>'error <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s has not been assigned"</span> X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
