melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline6" class="outline-3">
<h3 id="orgheadline6"><span class="section-number-3">2.4</span> KLambda Constants</h3>
<div class="outline-text-3" id="text-2-4">
<p>
Once <a href="#orgheadline5">the assigning mechanism</a> is in place the spec requires some global variables:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>shen/set '*home-directory* <span style="color: #666666;">""</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*stoutput* standard-output<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*stinput* <span style="color: #7388d6;">[</span><span style="color: #909183;">()</span><span style="color: #7388d6;">]</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*language* <span style="color: #666666;">"Elisp"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*implementation* <span style="color: #666666;">"Elisp"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*porters* <span style="color: #666666;">"Aditya Siram"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*release* <span style="color: #666666;">"0.0.0.1"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*port* <span style="color: #333333; font-weight: bold;">1.7</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>shen/set '*os* <span style="color: #666666;">"Linux"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline7" class="outline-3">
<h3 id="orgheadline7"><span class="section-number-3">2.5</span> Boolean Operations</h3>
<div class="outline-text-3" id="text-2-5">
<p>
Unlike Elisp in KLambda booleans are <code>false</code> and <code>true</code>, distinct symbols which
are not synonymous with <code>nil</code> and <code>(not nil)</code>.
</p>

<p>
Since <code>if</code> , <code>and</code> and <code>or</code> are special forms they are defined as macros to
preserve evaluation order.
</p>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/if</span> <span style="color: #7388d6;">(</span>X Y Z<span style="color: #7388d6;">)</span>
  `<span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>eq ,X 'true<span style="color: #909183;">)</span> ,Y ,Z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/and</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span> `<span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>and <span style="color: #709870;">(</span>eq ,X 'true<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq ,Y 'true<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/or</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span> `<span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>or <span style="color: #709870;">(</span>eq ,X 'true<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq ,Y 'true<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
KLambda's <code>cond</code>, unlike Elisp's forbids a fallthrough case - one of the
predicates must be true.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/cond</span> <span style="color: #7388d6;">(</span><span style="color: #333333; font-style: italic;">&amp;rest</span> CASES<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>predicates-quoted-cases
          <span style="color: #907373;">(</span>mapcar <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #858580;">(</span>predicate-result-pair<span style="color: #858580;">)</span>
                    <span style="color: #858580;">(</span>list <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #887070;">(</span>shen/symbol-p <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> predicate-result-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>list 'quote <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> predicate-result-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                            <span style="color: #887070;">(</span>list 'shen/shen-&gt;predicate <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> predicate-result-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                          <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> predicate-result-pair<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                  CASES<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>fallthrough-added <span style="color: #907373;">(</span>append predicates-quoted-cases <span style="color: #6276ba;">(</span>list '<span style="color: #858580;">(</span>t <span style="color: #80a880;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #666666;">"One of the cond predicates must be true."</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    `<span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span> ,@fallthrough-added<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline8" class="outline-3">
<h3 id="orgheadline8"><span class="section-number-3">2.6</span> Lambdas</h3>
<div class="outline-text-3" id="text-2-6">
<p>
Since Shen supports currying by default KLambda's <code>lambda</code> form is stripped down to only accept one
argument.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> X <span style="color: #7388d6;">(</span>...<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Multiple arguments are supported via nesting:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> X <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> Y <span style="color: #909183;">(</span>...<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The implementation delegates to Elisp's <code>lambda</code> form:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/lambda</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>eq X nil<span style="color: #909183;">)</span>
        `<span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">()</span> ,Y<span style="color: #909183;">)</span>
      `<span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>,X<span style="color: #709870;">)</span> ,Y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline9" class="outline-3">
<h3 id="orgheadline9"><span class="section-number-3">2.7</span> Lets</h3>
<div class="outline-text-3" id="text-2-7">
<p>
KLambda's <code>let</code> in a similar way only takes one assignment:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">let</span> X Y ...<span style="color: #707183;">)</span>
</pre>
</div>

<p>
Similarly multiple assignments are supported via nested <code>lets</code>:
</p>
<pre class="example">
(let W X (let Y Z ...))
</pre>

<p>
The implementation delegates to Elisp's <code>let</code>:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/let</span> <span style="color: #7388d6;">(</span>X Y Z<span style="color: #7388d6;">)</span>
  `<span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>,X ,Y<span style="color: #709870;">)</span><span style="color: #909183;">)</span> ,Z<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
