melpa/working/shen-elisp/shen-primitives.el
(shen/set '*stinput* [()])
(shen/set '*language* "Elisp")
(shen/set '*implementation* "Elisp")
(shen/set '*porters* "Aditya Siram")
(shen/set '*release* "0.0.0.1")
(shen/set '*port* 1.7)
(shen/set '*os* "Linux")
;; KLambda\ Constants:1 ends here

;; [[file:shen-elisp.org::*Boolean%20Operations][Boolean\ Operations:1]]
(defmacro shen/if (X Y Z)
  `(if (eq ,X 'true) ,Y ,Z))
(defmacro shen/and (X Y) `(shen/predicate->shen (and (eq ,X 'true) (eq ,Y 'true))))
(defmacro shen/or (X Y) `(shen/predicate->shen (or (eq ,X 'true) (eq ,Y 'true))))
;; Boolean\ Operations:1 ends here

;; [[file:shen-elisp.org::*Boolean%20Operations][Boolean\ Operations:2]]
(defmacro shen/cond (&rest CASES)
  (let* ((predicates-quoted-cases
          (mapcar (lambda (predicate-result-pair)
                    (list (if (shen/symbol-p (nth 0 predicate-result-pair))
                              (list 'quote (nth 0 predicate-result-pair))
                            (list 'shen/shen->predicate (nth 0 predicate-result-pair)))
                          (nth 1 predicate-result-pair)))
                  CASES))
         (fallthrough-added (append predicates-quoted-cases (list '(t (error "One of the cond predicates must be true."))))))
    `(cond ,@fallthrough-added)))
;; Boolean\ Operations:2 ends here

;; [[file:shen-elisp.org::*Lambdas][Lambdas:3]]
(defmacro shen/lambda (X Y)
  (if (eq X nil)
        `(lambda () ,Y)
      `(lambda (,X) ,Y)))
;; Lambdas:3 ends here

;; [[file:shen-elisp.org::*Lets][Lets:2]]
(defmacro shen/let (X Y Z)
  `(let ((,X ,Y)) ,Z))
;; Lets:2 ends here
