melpa/working/shen-elisp/shen-elisp.org
** Defuns
The structure of ~defun~ in KLambda is identical to Elisp's so a straight
translation works.

Functions are required to be tail-call optimized but that is done below
before the body is spliced in.

#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/defun (F Args Body) `(defun ,F ,Args ,Body))
#+END_SRC

** Other Generic Functions
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/= (X Y)
    (shen/predicate->shen
     (cond ((and (consp X) (consp Y)) (equal X Y))
           ((and (stringp X) (stringp Y)) (string-equal X Y))
           ((and (numberp X) (numberp Y)) (= X Y))
           ((and (vectorp X) (vectorp Y)) (and (= (length X) (length Y)) (equal X Y)))
           (t (equal X Y)))))
#+END_SRC

#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defmacro shen/freeze (X)
    `(function (lambda nil ,X)))
  (defsubst shen/type (X MyType) (declare (ignore MyType)) X)
#+END_SRC

** Lists
List construction in KLambda is done with ~cons~ exclusively. The KLambda list
~[ a b c ]~ for example is constructed:
#+BEGIN_EXAMPLE
(cons a (cons b (cons c ())))
#+END_EXAMPLE

Elisp also provides a ~cons~ so a straightforward translation is possible *but*
it blows the recursion stack after a certain number of elements. They are [[Consolidate Cons][rewritten]] to
~list~ calls below but a ~cons~ is provided to adhere to the standard:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/cons (A Rest)
    (cons A Rest))
#+END_SRC

The rest of the list operations function as expected:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/hd (List)    (car List))
  (defsubst shen/tl (List)    (cdr List))
  (defsubst shen/cons? (List) (shen/predicate->shen (consp List)))
#+END_SRC
