melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline10" class="outline-3">
<h3 id="orgheadline10"><span class="section-number-3">2.8</span> Defuns</h3>
<div class="outline-text-3" id="text-2-8">
<p>
The structure of <code>defun</code> in KLambda is identical to Elisp's so a straight
translation works.
</p>

<p>
Functions are required to be tail-call optimized but that is done below
before the body is spliced in.
</p>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/defun</span> <span style="color: #7388d6;">(</span>F Args Body<span style="color: #7388d6;">)</span> `<span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">defun</span> ,F ,Args ,Body<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline11" class="outline-3">
<h3 id="orgheadline11"><span class="section-number-3">2.9</span> Other Generic Functions</h3>
<div class="outline-text-3" id="text-2-9">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/=</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>consp X<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>consp Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>equal X Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>stringp X<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>stringp Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>string-equal X Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>numberp X<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>numberp Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>= X Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>vectorp X<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>vectorp Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>= <span style="color: #858580;">(</span>length X<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>length Y<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>equal X Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>t <span style="color: #907373;">(</span>equal X Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/freeze</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  `<span style="color: #7388d6;">(</span>function <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> nil ,X<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/type</span> <span style="color: #7388d6;">(</span>X MyType<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">declare</span> <span style="color: #909183;">(</span>ignore MyType<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> X<span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline13" class="outline-3">
<h3 id="orgheadline13"><span class="section-number-3">2.10</span> Lists</h3>
<div class="outline-text-3" id="text-2-10">
<p>
List construction in KLambda is done with <code>cons</code> exclusively. The KLambda list
<code>[ a b c ]</code> for example is constructed:
</p>
<pre class="example">
(cons a (cons b (cons c ())))
</pre>

<p>
Elisp also provides a <code>cons</code> so a straightforward translation is possible <b>but</b>
it blows the recursion stack after a certain number of elements. They are <a href="#orgheadline12">rewritten</a> to
<code>list</code> calls below but a <code>cons</code> is provided to adhere to the standard:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/cons</span> <span style="color: #7388d6;">(</span>A Rest<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>cons A Rest<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The rest of the list operations function as expected:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/hd</span> <span style="color: #7388d6;">(</span>List<span style="color: #7388d6;">)</span>    <span style="color: #7388d6;">(</span>car List<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/tl</span> <span style="color: #7388d6;">(</span>List<span style="color: #7388d6;">)</span>    <span style="color: #7388d6;">(</span>cdr List<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/cons?</span> <span style="color: #7388d6;">(</span>List<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>consp List<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
