melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*Defuns][Defuns:1]]
(defmacro shen/defun (F Args Body) `(defun ,F ,Args ,Body))
;; Defuns:1 ends here

;; [[file:shen-elisp.org::*Other%20Generic%20Functions][Other\ Generic\ Functions:1]]
(defsubst shen/= (X Y)
  (shen/predicate->shen
   (cond ((and (consp X) (consp Y)) (equal X Y))
         ((and (stringp X) (stringp Y)) (string-equal X Y))
         ((and (numberp X) (numberp Y)) (= X Y))
         ((and (vectorp X) (vectorp Y)) (and (= (length X) (length Y)) (equal X Y)))
         (t (equal X Y)))))
;; Other\ Generic\ Functions:1 ends here

;; [[file:shen-elisp.org::*Other%20Generic%20Functions][Other\ Generic\ Functions:2]]
(defmacro shen/freeze (X)
  `(function (lambda nil ,X)))
(defsubst shen/type (X MyType) (declare (ignore MyType)) X)
;; Other\ Generic\ Functions:2 ends here

;; [[file:shen-elisp.org::*Lists][Lists:1]]
(defsubst shen/cons (A Rest)
  (cons A Rest))
;; Lists:1 ends here

;; [[file:shen-elisp.org::*Lists][Lists:2]]
(defsubst shen/hd (List)    (car List))
(defsubst shen/tl (List)    (cdr List))
(defsubst shen/cons? (List) (shen/predicate->shen (consp List)))
;; Lists:2 ends here

;; [[file:shen-elisp.org::*Strings][Strings:1]]
(defun shen/str (X)
