melpa/working/shen-elisp/shen-elisp.org
** Strings
- Printing KLambda datatypes.

  The only weirdness here is why we print the ~buffer-name~
  of a stream. That is explained in the [[Streams and I/O]].:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/str (X)
    (cond ((null X) (error "null is not an atom in Shen; str cannot convert it to a string.~%"))
          ((symbolp X) (symbol-name X))
          ((or (numberp X) (stringp X) (functionp X)) (format "%s" X))
          ((and (bufferp X) (buffer-file-name X)) (buffer-name X))
          ((eq X standard-input) "standard-input")
          ((eq X standard-output) "standard-output")
          (t
           (error (format "%s is not an atom, stream or closure; str cannot convert it to a string." X)))))
#+END_SRC
- Given string ~S~ get the character at index ~N~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/pos (S N) (string (aref S N)))
#+END_SRC

- Get the rest of a non-empty string:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/tlstr (X) (substring X 1))
#+END_SRC

- Test for a string, join them and convert between characters and strings:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/string? (S) (shen/predicate->shen (stringp S)))
  (defsubst shen/cn (Str1 Str2) (concat Str1 Str2))
  (defsubst shen/n->string (N) (string N))
  (defsubst shen/string->n (S) (string-to-char S))
#+END_SRC

NOTE: If a non-empty string is converted to a character only the first character
of the string is considered.
** Error Handling
Elisp's ~error~ and ~condition-case~ covers the primitive error handling
required by the spec:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (define-error 'shen/error "Shen error" 'error)
  (defsubst shen/simple-error (E)
    (signal 'shen/error
            (if (stringp E)
                (list E)
              E)))
  (defmacro shen/trap-error (X F)
    `(condition-case ex ,X ('error (funcall ,F ex))))
  (defsubst shen/error-to-string (E) (format "%s" E))
#+END_SRC
