melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline15" class="outline-3">
<h3 id="orgheadline15"><span class="section-number-3">2.11</span> Strings</h3>
<div class="outline-text-3" id="text-2-11">
<ul class="org-ul">
<li><p>
Printing KLambda datatypes.
</p>

<p>
The only weirdness here is why we print the <code>buffer-name</code>
of a stream. That is explained in the <a href="#orgheadline14">2.16</a>.:
</p></li>
</ul>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/str</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">cond</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>null X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #666666;">"null is not an atom in Shen; str cannot convert it to a string.~%"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>symbolp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>symbol-name X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>or <span style="color: #907373;">(</span>numberp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>stringp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>functionp X<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>format <span style="color: #666666;">"%s"</span> X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>bufferp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>buffer-file-name X<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>buffer-name X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eq X standard-input<span style="color: #709870;">)</span> <span style="color: #666666;">"standard-input"</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #709870;">(</span>eq X standard-output<span style="color: #709870;">)</span> <span style="color: #666666;">"standard-output"</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>t
         <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s is not an atom, stream or closure; str cannot convert it to a string."</span> X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
<ul class="org-ul">
<li>Given string <code>S</code> get the character at index <code>N</code>:</li>
</ul>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/pos</span> <span style="color: #7388d6;">(</span>S N<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>string <span style="color: #909183;">(</span>aref S N<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Get the rest of a non-empty string:</li>
</ul>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/tlstr</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>substring X <span style="color: #333333; font-weight: bold;">1</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Test for a string, join them and convert between characters and strings:</li>
</ul>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/string?</span> <span style="color: #7388d6;">(</span>S<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>stringp S<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/cn</span> <span style="color: #7388d6;">(</span>Str1 Str2<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>concat Str1 Str2<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/n-&gt;string</span> <span style="color: #7388d6;">(</span>N<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>string N<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/string-&gt;n</span> <span style="color: #7388d6;">(</span>S<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>string-to-char S<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
NOTE: If a non-empty string is converted to a character only the first character
of the string is considered.
</p>
</div>
</div>
<div id="outline-container-orgheadline16" class="outline-3">
<h3 id="orgheadline16"><span class="section-number-3">2.12</span> Error Handling</h3>
<div class="outline-text-3" id="text-2-12">
<p>
Elisp's <code>error</code> and <code>condition-case</code> covers the primitive error handling
required by the spec:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>define-error 'shen/error <span style="color: #666666;">"Shen error"</span> 'error<span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/simple-error</span> <span style="color: #7388d6;">(</span>E<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> 'shen/error
          <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>stringp E<span style="color: #709870;">)</span>
              <span style="color: #709870;">(</span>list E<span style="color: #709870;">)</span>
            E<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defmacro</span> <span style="color: #333333; font-weight: bold;">shen/trap-error</span> <span style="color: #7388d6;">(</span>X F<span style="color: #7388d6;">)</span>
  `<span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex ,X <span style="color: #909183;">(</span>'error <span style="color: #709870;">(</span>funcall ,F ex<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/error-to-string</span> <span style="color: #7388d6;">(</span>E<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>format <span style="color: #666666;">"%s"</span> E<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
