melpa/working/shen-elisp/shen-primitives.el
  (cond ((null X) (error "null is not an atom in Shen; str cannot convert it to a string.~%"))
        ((symbolp X) (symbol-name X))
        ((or (numberp X) (stringp X) (functionp X)) (format "%s" X))
        ((and (bufferp X) (buffer-file-name X)) (buffer-name X))
        ((eq X standard-input) "standard-input")
        ((eq X standard-output) "standard-output")
        (t
         (error (format "%s is not an atom, stream or closure; str cannot convert it to a string." X)))))
;; Strings:1 ends here

;; [[file:shen-elisp.org::*Strings][Strings:2]]
(defsubst shen/pos (S N) (string (aref S N)))
;; Strings:2 ends here

;; [[file:shen-elisp.org::*Strings][Strings:3]]
(defsubst shen/tlstr (X) (substring X 1))
;; Strings:3 ends here

;; [[file:shen-elisp.org::*Strings][Strings:4]]
(defsubst shen/string? (S) (shen/predicate->shen (stringp S)))
(defsubst shen/cn (Str1 Str2) (concat Str1 Str2))
(defsubst shen/n->string (N) (string N))
(defsubst shen/string->n (S) (string-to-char S))
;; Strings:4 ends here

;; [[file:shen-elisp.org::*Error%20Handling][Error\ Handling:1]]
(define-error 'shen/error "Shen error" 'error)
(defsubst shen/simple-error (E)
  (signal 'shen/error
          (if (stringp E)
              (list E)
            E)))
(defmacro shen/trap-error (X F)
  `(condition-case ex ,X ('error (funcall ,F ex))))
(defsubst shen/error-to-string (E) (format "%s" E))
;; Error\ Handling:1 ends here
