melpa/working/shen-elisp/shen-elisp.org
** Vectors
Hash tables are used to represent Klambda vectors. This is counter-intuitive
since Elisp does have native vectors but unfortunately they are not resizable.
Since KLambda code tends to allocate huge vectors and resize often, switching
from vectors to hash-tables where resizing is natively supported led to 4-5x
speed-ups across the board.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/absvector (N) (make-hash-table :size N :rehash-size 3.0))
  (defsubst shen/address-> (Vector N Value) (progn (puthash N Value Vector) Vector))
  (defsubst shen/<-address (Vector N) (gethash N Vector))
  (defsubst shen/absvector? (X) (shen/predicate->shen (hash-table-p X)))
#+END_SRC
