melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline17" class="outline-3">
<h3 id="orgheadline17"><span class="section-number-3">2.13</span> Vectors</h3>
<div class="outline-text-3" id="text-2-13">
<p>
Hash tables are used to represent Klambda vectors. This is counter-intuitive
since Elisp does have native vectors but unfortunately they are not resizable.
Since KLambda code tends to allocate huge vectors and resize often, switching
from vectors to hash-tables where resizing is natively supported led to 4-5x
speed-ups across the board.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/absvector</span> <span style="color: #7388d6;">(</span>N<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>make-hash-table <span style="color: #333333; font-weight: bold;">:size</span> N <span style="color: #333333; font-weight: bold;">:rehash-size</span> <span style="color: #333333; font-weight: bold;">3.0</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/address-&gt;</span> <span style="color: #7388d6;">(</span>Vector N Value<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span> <span style="color: #909183;">(</span>puthash N Value Vector<span style="color: #909183;">)</span> Vector<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/&lt;-address</span> <span style="color: #7388d6;">(</span>Vector N<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>gethash N Vector<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/absvector?</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>hash-table-p X<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
