melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*Vectors][Vectors:1]]
(defsubst shen/absvector (N) (make-hash-table :size N :rehash-size 3.0))
(defsubst shen/address-> (Vector N Value) (progn (puthash N Value Vector) Vector))
(defsubst shen/<-address (Vector N) (gethash N Vector))
(defsubst shen/absvector? (X) (shen/predicate->shen (hash-table-p X)))
;; Vectors:1 ends here
