melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline18" class="outline-3">
<h3 id="orgheadline18"><span class="section-number-3">2.14</span> Arithmetic Operations</h3>
<div class="outline-text-3" id="text-2-14">
<p>
In KLambda there is only <code>number</code> so we have to take care to coerce to between <code>float</code> and
<code>integer</code> as necessary.
</p>

<p>
Most of this code is heavily borrowed from <a href="https://github.com/larsbrinkhoff/emacs-cl/blob/master/src/cl-numbers.el">emacs-cl</a> but simplified since Shen does not have
the zoo of numeric types supported by CL.
</p>

<p>
First a couple of limits to detect when a multiplication or addition might exceed the bounds
of an <code>integer</code>,
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/multiplication-limit</span> <span style="color: #7388d6;">(</span>floor <span style="color: #909183;">(</span>sqrt most-positive-fixnum<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/addition-limit</span> <span style="color: #7388d6;">(</span>floor <span style="color: #909183;">(</span>/ most-positive-fixnum <span style="color: #333333; font-weight: bold;">2</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
a generic function to coerce to a float if necessary,
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/number-op</span> <span style="color: #7388d6;">(</span>X Y max op<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>integerp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>integerp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>&lt; X max<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>&gt; X <span style="color: #858580;">(</span>- max<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>&lt; Y max<span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>&gt; Y <span style="color: #858580;">(</span>- max<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>apply op <span style="color: #6276ba;">(</span>list X Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span>apply op <span style="color: #6276ba;">(</span>list <span style="color: #858580;">(</span>float X<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>float Y<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>floatp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>numberp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>apply op <span style="color: #907373;">(</span>list X <span style="color: #6276ba;">(</span>float Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>numberp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>floatp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span> <span style="color: #709870;">(</span>apply op <span style="color: #907373;">(</span>list <span style="color: #6276ba;">(</span>float X<span style="color: #6276ba;">)</span> Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>t <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #666666;">"Trying to %s. Both %s and %s must be numbers"</span> op X Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and the standard arithmetic functions.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/*</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/number-op X Y shen/multiplication-limit #'*<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/+</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/number-op X Y shen/addition-limit #'+<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/-</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/number-op X Y shen/addition-limit #'-<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
When we divide we leave the result an integer if we can:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen//</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>or <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>numberp X<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>numberp Y<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #666666;">"Both %s and %s must be numbers."</span> X Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>integerp X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>integerp Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>Div <span style="color: #858580;">(</span>/ <span style="color: #80a880;">(</span>float X<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>float Y<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
           <span style="color: #6276ba;">(</span>Truncated <span style="color: #858580;">(</span>floor Div<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>= Truncated Div<span style="color: #6276ba;">)</span>
          Truncated
        Div<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>t <span style="color: #709870;">(</span>/ <span style="color: #907373;">(</span>float X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>float Y<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
And finally the standard number predicates are pretty compatible with Elisp so we just
wrap the Elisp functions:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/&gt;</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>     <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>&gt; X Y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/&lt;</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>     <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>&lt; X Y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/&gt;=</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>    <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>&gt;= X Y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/&lt;=</span> <span style="color: #7388d6;">(</span>X Y<span style="color: #7388d6;">)</span>    <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>&lt;= X Y<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/number?</span> <span style="color: #7388d6;">(</span>N<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>shen/predicate-&gt;shen <span style="color: #909183;">(</span>numberp N<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
