melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*Arithmetic%20Operations][Arithmetic\ Operations:1]]
(defconst shen/multiplication-limit (floor (sqrt most-positive-fixnum)))
(defconst shen/addition-limit (floor (/ most-positive-fixnum 2)))
;; Arithmetic\ Operations:1 ends here

;; [[file:shen-elisp.org::*Arithmetic%20Operations][Arithmetic\ Operations:2]]
(defun shen/number-op (X Y max op)
  (cond
   ((and (integerp X) (integerp Y))
    (if (and (< X max)
             (> X (- max))
             (< Y max)
             (> Y (- max)))
        (apply op (list X Y))
      (apply op (list (float X) (float Y)))))
   ((and (floatp X) (numberp Y)) (apply op (list X (float Y))))
   ((and (numberp X) (floatp Y)) (apply op (list (float X) Y)))
   (t (error (format "Trying to %s. Both %s and %s must be numbers" op X Y)))))
;; Arithmetic\ Operations:2 ends here

;; [[file:shen-elisp.org::*Arithmetic%20Operations][Arithmetic\ Operations:3]]
(defsubst shen/* (X Y) (shen/number-op X Y shen/multiplication-limit #'*))
(defsubst shen/+ (X Y) (shen/number-op X Y shen/addition-limit #'+))
(defsubst shen/- (X Y) (shen/number-op X Y shen/addition-limit #'-))
;; Arithmetic\ Operations:3 ends here

;; [[file:shen-elisp.org::*Arithmetic%20Operations][Arithmetic\ Operations:4]]
(defsubst shen// (X Y)
  (cond
   ((or (not (numberp X)) (not (numberp Y)))
    (error (format "Both %s and %s must be numbers." X Y)))
   ((and (integerp X) (integerp Y))
    (let* ((Div (/ (float X) (float Y)))
           (Truncated (floor Div)))
      (if (= Truncated Div)
          Truncated
        Div)))
   (t (/ (float X) (float Y)))))
;; Arithmetic\ Operations:4 ends here

;; [[file:shen-elisp.org::*Arithmetic%20Operations][Arithmetic\ Operations:5]]
(defsubst shen/> (X Y)     (shen/predicate->shen (> X Y)))
(defsubst shen/< (X Y)     (shen/predicate->shen (< X Y)))
(defsubst shen/>= (X Y)    (shen/predicate->shen (>= X Y)))
(defsubst shen/<= (X Y)    (shen/predicate->shen (<= X Y)))
(defsubst shen/number? (N) (shen/predicate->shen (numberp N)))
;; Arithmetic\ Operations:5 ends here
