melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline19" class="outline-3">
<h3 id="orgheadline19"><span class="section-number-3">2.15</span> Time</h3>
<div class="outline-text-3" id="text-2-15">
<p>
The <code>get-time</code> primitive given <code>real</code> or <code>unix</code> returns the current Unix time
(seconds since Jan 1st 1970) and given <code>run</code> returns the CPU time according to
Emacs.
</p>

<p>
Both Emacs functions <code>get-internal-run-time</code> and <code>current-time</code> return a 32-bit
number as a tuple where the first is the 16 high bits and the second is the 16
lower bits. To put them together we normalize the high bits by multiplying them
with 2^16 and add the result to the lower bits.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/2^16</span> <span style="color: #333333; font-weight: bold;">65536</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/get-time</span> <span style="color: #7388d6;">(</span>Time<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">cl-flet</span>
      <span style="color: #909183;">(</span><span style="color: #709870;">(</span>timespec-to-number <span style="color: #907373;">(</span>spec<span style="color: #907373;">)</span>
                           <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>high <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> spec<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                                  <span style="color: #858580;">(</span>low <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> spec<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                             <span style="color: #6276ba;">(</span>+ <span style="color: #858580;">(</span>* high shen/2^16<span style="color: #858580;">)</span> low<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq Time 'run<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>timespec-to-number <span style="color: #6276ba;">(</span>get-internal-run-time<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq Time 'real<span style="color: #907373;">)(</span>timespec-to-number <span style="color: #6276ba;">(</span>current-time<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq Time 'unix<span style="color: #907373;">)(</span>timespec-to-number <span style="color: #6276ba;">(</span>current-time<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
          <span style="color: #709870;">(</span>t <span style="color: #907373;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #6276ba;">(</span>format <span style="color: #666666;">"get-time does not understand parameter %s."</span> Time<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
