melpa/working/shen-elisp/shen-elisp.org
** Streams and I/O
Streams at the KLambda level are just an abstraction over file I/O. At the Elisp
level ~X~ is a stream if it is a buffer with an associated file. That last bit
is important, because per the spec, buffers that aren't tied to the underlying
filesystem are not streams.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/streamp (X) (and (bufferp X) (buffer-file-name X)))
#+END_SRC

Opening a stream takes a path ~Path~ and, per the spec, makes it relative to the
global ~*home-directory*~ variable. It also takes a ~Direction~ which is either
~in~ or ~out~ meaning we are either reading or writing.

A file opened with ~Direction~ ~in~, as in ~(open some-file.txt in)~ is
considered read-only. It must be opened with ~Direction~ ~out~, as in ~(open
some-file.txt out)~ in order to be able to write to it. A read-only
file stream must be ~close~ -ed and re-opened ~out~ before it can be written.

Additionally buffers ~open~ -ed by Shen are "marked" with a buffer local variable
~shen/shen-buffer~ to ensure that only Shen code can ~read~ / ~write~ / ~close~
them:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/open (Path Direction)
    (let ((Path (concat (file-name-as-directory (shen/value '*home-directory*))
                        (file-relative-name Path)))
          (Buffer))
      (cond
       ((equal Direction 'in)
        (if (not (file-exists-p Path))
            (error (format "Path does not exist: %s" Path))
          (progn
            (setq Buffer (find-file-noselect Path))
            (with-current-buffer
                Buffer
              (progn
                (make-local-variable 'shen/shen-buffer)
                (setq buffer-read-only 't
                      shen/shen-buffer 't)
                (goto-char (point-min))))
            Buffer)))
       ((equal Direction 'out)
        (progn
          (setq Buffer (find-buffer-visiting Path))
          (if (bufferp Buffer)
              (if (and (buffer-local-value 'buffer-read-only Buffer) (buffer-local-value 'shen/shen-buffer Buffer))
                  (error (format  "A stream to %s already open read-only. Call (close \"%s\") followed by (open \"%s\" 'out). " Path Path Path))
                Buffer)
            (progn
              (setq Buffer (find-file-noselect Path))
              (with-current-buffer Buffer
                (progn
                  (goto-char (point-max))
                  (make-local-variable 'shen/shen-buffer)
                  (setq shen/shen-buffer 't))))))))))
#+END_SRC

- Before closing, reading or writing to a buffer first check that it was opened by
  a Shen program.

A further bit of weirdness is that ~write-byte~ switches on a [[(write-byte-function)][function]]. This is because
when writing out to the [[Shen REPL]] requires calling a function with the character.
#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
  (defun shen/close (Stream)
    (if (not Stream)
        (error "Stream is nil.")
      (if (or (not (local-variable-p 'shen/shen-buffer Stream))
              (not (buffer-local-value 'shen/shen-buffer Stream)))
          (error (format "Buffer %s for file %s was not opened by Shen's (open ...) function." Stream (buffer-file-name Stream)))
        (cond ((buffer-local-value 'buffer-read-only Stream) (kill-buffer Stream))
              (t (with-current-buffer
                     Stream
                   (progn
                     (write-file (buffer-file-name Stream))
                     (kill-buffer Stream)
                     '())))))))

  (defun shen/write-byte (Byte &optional S)
    (if S
        (cond
         ((bufferp S)
          (if (not (buffer-local-value 'buffer-read-only S))
              (error (format "Buffer %s is read-only." S))
            (if (buffer-local-value 'shen/shen-buffer S)
                (write-char Byte S)
              (error (format "Buffer %s was not opened by Shen." S)))))
         ((functionp S) ;; (ref:write-byte-function)
          (funcall S Byte))
         (t (write-char (shen/stoutput) Byte)))
      (funcall (shen/stoutput) Byte)))

  (defun shen/read-byte (&optional S)
    (cond
     ((and (bufferp S) (buffer-file-name S))
      (if (buffer-local-value 'shen/shen-buffer S)
          (with-current-buffer S
            (let ((current-byte))
              (if (eq (point) (point-max))
                  -1
                (progn
                  (setq current-byte (get-byte))
                  (forward-char)
                  current-byte))))
        (error (format "Buffer %s was not opened by Shen." S))))
     ((vectorp S) (if (not (aref S 0))
                      -1
                    (pop (aref S 0))))
     (t (error (format "Unrecognized stream format %s" S)))))
#+END_SRC
