melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline14" class="outline-3">
<h3 id="orgheadline14"><span class="section-number-3">2.16</span> Streams and I/O</h3>
<div class="outline-text-3" id="text-2-16">
<p>
Streams at the KLambda level are just an abstraction over file I/O. At the Elisp
level <code>X</code> is a stream if it is a buffer with an associated file. That last bit
is important, because per the spec, buffers that aren't tied to the underlying
filesystem are not streams.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/streamp</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>and <span style="color: #909183;">(</span>bufferp X<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>buffer-file-name X<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Opening a stream takes a path <code>Path</code> and, per the spec, makes it relative to the
global <code>*home-directory*</code> variable. It also takes a <code>Direction</code> which is either
<code>in</code> or <code>out</code> meaning we are either reading or writing.
</p>

<p>
A file opened with <code>Direction</code> <code>in</code>, as in <code>(open some-file.txt in)</code> is
considered read-only. It must be opened with <code>Direction</code> <code>out</code>, as in <code>(open
some-file.txt out)</code> in order to be able to write to it. A read-only
file stream must be <code>close</code> -ed and re-opened <code>out</code> before it can be written.
</p>

<p>
Additionally buffers <code>open</code> -ed by Shen are "marked" with a buffer local variable
<code>shen/shen-buffer</code> to ensure that only Shen code can <code>read</code> / <code>write</code> / <code>close</code>
them:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/open</span> <span style="color: #7388d6;">(</span>Path Direction<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>Path <span style="color: #907373;">(</span>concat <span style="color: #6276ba;">(</span>file-name-as-directory <span style="color: #858580;">(</span>shen/value '*home-directory*<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span>file-relative-name Path<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>Buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>equal Direction 'in<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>file-exists-p Path<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #858580;">(</span>format <span style="color: #666666;">"Path does not exist: %s"</span> Path<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
          <span style="color: #858580;">(</span>setq Buffer <span style="color: #80a880;">(</span>find-file-noselect Path<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span>
              Buffer
            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
              <span style="color: #887070;">(</span>make-local-variable 'shen/shen-buffer<span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq buffer-read-only 't
                    shen/shen-buffer 't<span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>goto-char <span style="color: #707183;">(</span>point-min<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          Buffer<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>equal Direction 'out<span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
        <span style="color: #6276ba;">(</span>setq Buffer <span style="color: #858580;">(</span>find-buffer-visiting Path<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>bufferp Buffer<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>and <span style="color: #887070;">(</span>buffer-local-value 'buffer-read-only Buffer<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>buffer-local-value 'shen/shen-buffer Buffer<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #887070;">(</span>format  <span style="color: #666666;">"A stream to %s already open read-only. Call (close \"%s\") followed by (open \"%s\" 'out). "</span> Path Path Path<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
              Buffer<span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
            <span style="color: #80a880;">(</span>setq Buffer <span style="color: #887070;">(</span>find-file-noselect Path<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span> Buffer
              <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                <span style="color: #707183;">(</span>goto-char <span style="color: #7388d6;">(</span>point-max<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                <span style="color: #707183;">(</span>make-local-variable 'shen/shen-buffer<span style="color: #707183;">)</span>
                <span style="color: #707183;">(</span>setq shen/shen-buffer 't<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<ul class="org-ul">
<li>Before closing, reading or writing to a buffer first check that it was opened by
a Shen program.</li>
</ul>

<p>
A further bit of weirdness is that <code>write-byte</code> switches on a <a href="#coderef-write-byte-function"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-write-byte-function');" onmouseout="CodeHighlightOff(this, 'coderef-write-byte-function');">function</a>. This is because
when writing out to the <a href="#orgheadline20">9</a> requires calling a function with the character.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/close</span> <span style="color: #7388d6;">(</span>Stream<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>not Stream<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #666666;">"Stream is nil."</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>or <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>local-variable-p 'shen/shen-buffer Stream<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>buffer-local-value 'shen/shen-buffer Stream<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #666666;">"Buffer %s for file %s was not opened by Shen's (open ...) function."</span> Stream <span style="color: #6276ba;">(</span>buffer-file-name Stream<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">cond</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>buffer-local-value 'buffer-read-only Stream<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>kill-buffer Stream<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>t <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span>
                   Stream
                 <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                   <span style="color: #80a880;">(</span>write-file <span style="color: #887070;">(</span>buffer-file-name Stream<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>kill-buffer Stream<span style="color: #80a880;">)</span>
                   '<span style="color: #80a880;">()</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/write-byte</span> <span style="color: #7388d6;">(</span>Byte <span style="color: #333333; font-style: italic;">&amp;optional</span> S<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> S
      <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
       <span style="color: #709870;">(</span><span style="color: #907373;">(</span>bufferp S<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>buffer-local-value 'buffer-read-only S<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #858580;">(</span>format <span style="color: #666666;">"Buffer %s is read-only."</span> S<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>buffer-local-value 'shen/shen-buffer S<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>write-char Byte S<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #80a880;">(</span>format <span style="color: #666666;">"Buffer %s was not opened by Shen."</span> S<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
<span id="coderef-write-byte-function" class="coderef-off">       <span style="color: #709870;">(</span><span style="color: #907373;">(</span>functionp S<span style="color: #907373;">)</span> <span style="color: #d9d9d9;">;;</span> (write-byte-function)</span>
        <span style="color: #907373;">(</span>funcall S Byte<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span>t <span style="color: #907373;">(</span>write-char <span style="color: #6276ba;">(</span>shen/stoutput<span style="color: #6276ba;">)</span> Byte<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>funcall <span style="color: #709870;">(</span>shen/stoutput<span style="color: #709870;">)</span> Byte<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/read-byte</span> <span style="color: #7388d6;">(</span><span style="color: #333333; font-style: italic;">&amp;optional</span> S<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>bufferp S<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>buffer-file-name S<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
    <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>buffer-local-value 'shen/shen-buffer S<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span> S
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>current-byte<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>eq <span style="color: #887070;">(</span>point<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>point-max<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #333333; font-weight: bold;">-1</span>
              <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                <span style="color: #887070;">(</span>setq current-byte <span style="color: #707183;">(</span>get-byte<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span>forward-char<span style="color: #887070;">)</span>
                current-byte<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
      <span style="color: #907373;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #6276ba;">(</span>format <span style="color: #666666;">"Buffer %s was not opened by Shen."</span> S<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>vectorp S<span style="color: #709870;">)</span> <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>aref S <span style="color: #333333; font-weight: bold;">0</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                    <span style="color: #333333; font-weight: bold;">-1</span>
                  <span style="color: #907373;">(</span>pop <span style="color: #6276ba;">(</span>aref S <span style="color: #333333; font-weight: bold;">0</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>t <span style="color: #709870;">(</span><span style="color: #ff0000; font-weight: bold;">error</span> <span style="color: #907373;">(</span>format <span style="color: #666666;">"Unrecognized stream format %s"</span> S<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
