melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*Streams%20and%20I/O][Streams\ and\ I/O:2]]
(defun shen/open (Path Direction)
  (let ((Path (concat (file-name-as-directory (shen/value '*home-directory*))
                      (file-relative-name Path)))
        (Buffer))
    (cond
     ((equal Direction 'in)
      (if (not (file-exists-p Path))
          (error (format "Path does not exist: %s" Path))
        (progn
          (setq Buffer (find-file-noselect Path))
          (with-current-buffer
              Buffer
            (progn
              (make-local-variable 'shen/shen-buffer)
              (setq buffer-read-only 't
                    shen/shen-buffer 't)
              (goto-char (point-min))))
          Buffer)))
     ((equal Direction 'out)
      (progn
        (setq Buffer (find-buffer-visiting Path))
        (if (bufferp Buffer)
            (if (and (buffer-local-value 'buffer-read-only Buffer) (buffer-local-value 'shen/shen-buffer Buffer))
                (error (format  "A stream to %s already open read-only. Call (close \"%s\") followed by (open \"%s\" 'out). " Path Path Path))
              Buffer)
          (progn
            (setq Buffer (find-file-noselect Path))
            (with-current-buffer Buffer
              (progn
                (goto-char (point-max))
                (make-local-variable 'shen/shen-buffer)
                (setq shen/shen-buffer 't))))))))))
;; Streams\ and\ I/O:2 ends here

;; [[file:shen-elisp.org::*Streams%20and%20I/O][Streams\ and\ I/O:3]]
(defun shen/close (Stream)
  (if (not Stream)
      (error "Stream is nil.")
    (if (or (not (local-variable-p 'shen/shen-buffer Stream))
            (not (buffer-local-value 'shen/shen-buffer Stream)))
        (error (format "Buffer %s for file %s was not opened by Shen's (open ...) function." Stream (buffer-file-name Stream)))
      (cond ((buffer-local-value 'buffer-read-only Stream) (kill-buffer Stream))
            (t (with-current-buffer
                   Stream
                 (progn
                   (write-file (buffer-file-name Stream))
                   (kill-buffer Stream)
                   '())))))))

(defun shen/write-byte (Byte &optional S)
  (if S
      (cond
       ((bufferp S)
        (if (not (buffer-local-value 'buffer-read-only S))
            (error (format "Buffer %s is read-only." S))
          (if (buffer-local-value 'shen/shen-buffer S)
              (write-char Byte S)
            (error (format "Buffer %s was not opened by Shen." S)))))
       ((functionp S) ;; (ref:write-byte-function)
        (funcall S Byte))
       (t (write-char (shen/stoutput) Byte)))
    (funcall (shen/stoutput) Byte)))

(defun shen/read-byte (&optional S)
  (cond
   ((and (bufferp S) (buffer-file-name S))
    (if (buffer-local-value 'shen/shen-buffer S)
        (with-current-buffer S
          (let ((current-byte))
            (if (eq (point) (point-max))
                -1
              (progn
                (setq current-byte (get-byte))
                (forward-char)
                current-byte))))
      (error (format "Buffer %s was not opened by Shen." S))))
   ((vectorp S) (if (not (aref S 0))
                    -1
                  (pop (aref S 0))))
   (t (error (format "Unrecognized stream format %s" S)))))
;; Streams\ and\ I/O:3 ends here
