melpa/working/shen-elisp/shen-elisp.org
* Utilities
** Lookup
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/lookup-with-default (KEY ALIST DEFAULT)
    (car (or (assoc-default KEY ALIST) (list DEFAULT))))
#+END_SRC
** Boolean Operations
Helpers for translating between Elisp's and Shen's boolean values:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defsubst shen/shen->predicate (X)
    (eq X 'true))
  (defsubst shen/predicate->shen (X)
    (if X (quote true) (quote false)))
#+END_SRC
** AST Utilities
The next few sections are about transforming the KLambda AST so we
need a few utilites to make the job easier.
*** AST Getter/Setter
Paths in the AST are stored as a list of numbers. A getter to the path
~'(0 4 3)~ given an ~ast~ simply folds over the list into ~(nth 0 (nth 4 (nth 3
ast)))~.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/get-element-at (path ast)
    (let ((res ast))
      (dolist (current-index (reverse path) res)
        (setq res (nth current-index res)))))
#+END_SRC

For the setter we use Elisp's ~setf~ which takes a ~PLACE~ expression and a
value. Given the previous example path ~(0 4 3)~ , ~(setf (nth 0 (nth 4 (nth
3 ast))) 'x)~ changes the 1st element of the 3rd element of the 2nd element to
~'x~. This function is more complex because unlike the getter we can't just
iterate down the tree, we have to /build/ the ~PLACE~ expression completely
before handing it off to ~setf~.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/nset-element-at (path ast new-element)
    (if (= 0 (length path))
        (setf ast new-element)
      (let ((place-fn)
            (path (reverse path)))
        (progn
          (dotimes (current-index (length path) nil)
            (setq place-fn
                  (if (= current-index 0)
                      `(nth ,(nth current-index path) (quote ,ast))
                    `(nth ,(nth current-index path) ,place-fn))))
          (if (or (consp new-element) (shen/symbol-p new-element))
              (eval `(setf ,place-fn (quote ,new-element)) 't)
            (eval `(setf ,place-fn ,new-element)) 't)
          ast))))
#+END_SRC

*** AST Search
