melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline32" class="outline-2">
<h2 id="orgheadline32"><span class="section-number-2">3</span> Utilities</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-orgheadline22" class="outline-3">
<h3 id="orgheadline22"><span class="section-number-3">3.1</span> Lookup</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/lookup-with-default</span> <span style="color: #7388d6;">(</span>KEY ALIST DEFAULT<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>car <span style="color: #909183;">(</span>or <span style="color: #709870;">(</span>assoc-default KEY ALIST<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>list DEFAULT<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline23" class="outline-3">
<h3 id="orgheadline23"><span class="section-number-3">3.2</span> Boolean Operations</h3>
<div class="outline-text-3" id="text-3-2">
<p>
Helpers for translating between Elisp's and Shen's boolean values:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/shen-&gt;predicate</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>eq X 'true<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defsubst</span> <span style="color: #333333; font-weight: bold;">shen/predicate-&gt;shen</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> X <span style="color: #909183;">(</span>quote true<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>quote false<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline30" class="outline-3">
<h3 id="orgheadline30"><span class="section-number-3">3.3</span> AST Utilities</h3>
<div class="outline-text-3" id="text-3-3">
<p>
The next few sections are about transforming the KLambda AST so we
need a few utilites to make the job easier.
</p>
</div>
<div id="outline-container-orgheadline24" class="outline-4">
<h4 id="orgheadline24"><span class="section-number-4">3.3.1</span> AST Getter/Setter</h4>
<div class="outline-text-4" id="text-3-3-1">
<p>
Paths in the AST are stored as a list of numbers. A getter to the path
~'(0 4 3)~ given an <code>ast</code> simply folds over the list into <code>(nth 0 (nth 4 (nth 3
ast)))</code>.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/get-element-at</span> <span style="color: #7388d6;">(</span>path ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>res ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #709870;">(</span>current-index <span style="color: #907373;">(</span>reverse path<span style="color: #907373;">)</span> res<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>setq res <span style="color: #907373;">(</span>nth current-index res<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
For the setter we use Elisp's <code>setf</code> which takes a <code>PLACE</code> expression and a
value. Given the previous example path <code>(0 4 3)</code> , <code>(setf (nth 0 (nth 4 (nth
3 ast))) 'x)</code> changes the 1st element of the 3rd element of the 2nd element to
~'x~. This function is more complex because unlike the getter we can't just
iterate down the tree, we have to <i>build</i> the <code>PLACE</code> expression completely
before handing it off to <code>setf</code>.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/nset-element-at</span> <span style="color: #7388d6;">(</span>path ast new-element<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>= <span style="color: #333333; font-weight: bold;">0</span> <span style="color: #709870;">(</span>length path<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>setf ast new-element<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>place-fn<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>path <span style="color: #6276ba;">(</span>reverse path<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #6276ba;">(</span>current-index <span style="color: #858580;">(</span>length path<span style="color: #858580;">)</span> nil<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>setq place-fn
                <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>= current-index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #80a880;">)</span>
                    `<span style="color: #80a880;">(</span>nth ,<span style="color: #887070;">(</span>nth current-index path<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>quote ,ast<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  `<span style="color: #80a880;">(</span>nth ,<span style="color: #887070;">(</span>nth current-index path<span style="color: #887070;">)</span> ,place-fn<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>or <span style="color: #858580;">(</span>consp new-element<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>shen/symbol-p new-element<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>eval `<span style="color: #858580;">(</span>setf ,place-fn <span style="color: #80a880;">(</span>quote ,new-element<span style="color: #80a880;">)</span><span style="color: #858580;">)</span> 't<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>eval `<span style="color: #858580;">(</span>setf ,place-fn ,new-element<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> 't<span style="color: #907373;">)</span>
        ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
