melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*Lookup][Lookup:1]]
(defun shen/internal/lookup-with-default (KEY ALIST DEFAULT)
  (car (or (assoc-default KEY ALIST) (list DEFAULT))))
;; Lookup:1 ends here

;; [[file:shen-elisp.org::*Boolean%20Operations][Boolean\ Operations:1]]
(defsubst shen/shen->predicate (X)
  (eq X 'true))
(defsubst shen/predicate->shen (X)
  (if X (quote true) (quote false)))
;; Boolean\ Operations:1 ends here

;; [[file:shen-elisp.org::*AST%20Getter/Setter][AST\ Getter/Setter:1]]
(defun shen/internal/get-element-at (path ast)
  (let ((res ast))
    (dolist (current-index (reverse path) res)
      (setq res (nth current-index res)))))
;; AST\ Getter/Setter:1 ends here

;; [[file:shen-elisp.org::*AST%20Getter/Setter][AST\ Getter/Setter:2]]
(defun shen/internal/nset-element-at (path ast new-element)
  (if (= 0 (length path))
      (setf ast new-element)
    (let ((place-fn)
          (path (reverse path)))
      (progn
        (dotimes (current-index (length path) nil)
          (setq place-fn
                (if (= current-index 0)
                    `(nth ,(nth current-index path) (quote ,ast))
                  `(nth ,(nth current-index path) ,place-fn))))
        (if (or (consp new-element) (shen/symbol-p new-element))
            (eval `(setf ,place-fn (quote ,new-element)) 't)
          (eval `(setf ,place-fn ,new-element)) 't)
        ast))))
;; AST\ Getter/Setter:2 ends here
