melpa/working/shen-elisp/shen-elisp.org
**** Find All
Search the tree and return paths to all the elements that are ~equal~ to the given ~X~.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/find-all (X ast)
    (if (not (consp ast))
        'shen/not-found
      (let ((lists-left-to-search `((() ,ast)))
            (found 'shen/not-found))
        (while lists-left-to-search
          (let* ((search-candidate (car lists-left-to-search))
                 (search-candidate-path (nth 0 search-candidate))
                 (current-list (nth 1 search-candidate)))
            (progn
              (setq lists-left-to-search (cdr lists-left-to-search))
              (dotimes (current-index (length current-list) nil)
                (let ((current-element (nth current-index current-list))
                      (current-path (cons current-index search-candidate-path)))
                  (if (equal X current-element)
                      (if (consp found)
                          (push current-path found)
                        (setq found (list current-path)))
                    (if (consp current-element)
                        (push `(,current-path ,current-element)
                              lists-left-to-search))))))))
        found)))
#+END_SRC
