melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline27" class="outline-4">
<h4 id="orgheadline27"><span class="section-number-4">3.3.2</span> AST Search</h4>
<div class="outline-text-4" id="text-3-3-2">
</div><ol class="org-ol"><li><a id="orgheadline25"></a>Find All<br  /><div class="outline-text-5" id="text-3-3-2-1">
<p>
Search the tree and return paths to all the elements that are <code>equal</code> to the given <code>X</code>.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/find-all</span> <span style="color: #7388d6;">(</span>X ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      'shen/not-found
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>lists-left-to-search `<span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #80a880;">()</span> ,ast<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>found 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">while</span> lists-left-to-search
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>search-candidate <span style="color: #80a880;">(</span>car lists-left-to-search<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>search-candidate-path <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> search-candidate<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>current-list <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> search-candidate<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
            <span style="color: #858580;">(</span>setq lists-left-to-search <span style="color: #80a880;">(</span>cdr lists-left-to-search<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #80a880;">(</span>current-index <span style="color: #887070;">(</span>length current-list<span style="color: #887070;">)</span> nil<span style="color: #80a880;">)</span>
              <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>current-element <span style="color: #7388d6;">(</span>nth current-index current-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                    <span style="color: #707183;">(</span>current-path <span style="color: #7388d6;">(</span>cons current-index search-candidate-path<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #707183;">(</span>equal X current-element<span style="color: #707183;">)</span>
                    <span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>consp found<span style="color: #7388d6;">)</span>
                        <span style="color: #7388d6;">(</span>push current-path found<span style="color: #7388d6;">)</span>
                      <span style="color: #7388d6;">(</span>setq found <span style="color: #909183;">(</span>list current-path<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                  <span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>consp current-element<span style="color: #7388d6;">)</span>
                      <span style="color: #7388d6;">(</span>push `<span style="color: #909183;">(</span>,current-path ,current-element<span style="color: #909183;">)</span>
                            lists-left-to-search<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      found<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li>
