melpa/working/shen-elisp/shen-elisp.html
<li><a id="orgheadline26"></a>Find Containing List<br  /><div class="outline-text-5" id="text-3-3-2-2">
<p>
In addition to accessing and modifying an element given a path we also need
a function that finds the list that contains an element. This following function,
given an element <code>X</code>, a predicate function that takes <b>a list</b> that might contain
the element and an <code>ast</code>, returns a path to <b>the list</b> containing that element
not a path to the element itself.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/list-containing-first-occurrence-of</span> <span style="color: #7388d6;">(</span>list-pred ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      'shen/not-found
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>lists-left-to-search `<span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #80a880;">()</span> ,ast<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>found 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #6276ba;">(</span>and lists-left-to-search <span style="color: #858580;">(</span>eq found 'shen/not-found<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>search-candidate <span style="color: #887070;">(</span>car lists-left-to-search<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                 <span style="color: #80a880;">(</span>search-candidate-path <span style="color: #887070;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> search-candidate<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                 <span style="color: #80a880;">(</span>current-list <span style="color: #887070;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> search-candidate<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                 <span style="color: #80a880;">(</span>current-list-length <span style="color: #887070;">(</span>length current-list<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>funcall list-pred current-list<span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>setq found search-candidate-path<span style="color: #80a880;">)</span>
              <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                <span style="color: #887070;">(</span>setq lists-left-to-search
                      <span style="color: #707183;">(</span>append
                       <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>reversed-lists-in-current-list<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                         <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #709870;">(</span>current-index current-list-length <span style="color: #907373;">(</span>reverse reversed-lists-in-current-list<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                           <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>consp <span style="color: #6276ba;">(</span>nth current-index current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                               <span style="color: #907373;">(</span>setq reversed-lists-in-current-list
                                     <span style="color: #6276ba;">(</span>cons <span style="color: #858580;">(</span>list <span style="color: #80a880;">(</span>cons current-index search-candidate-path<span style="color: #80a880;">)</span>
                                                 <span style="color: #80a880;">(</span>nth current-index current-list<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                                           reversed-lists-in-current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                       <span style="color: #7388d6;">(</span>cdr lists-left-to-search<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        found<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li></ol>
</div>
