melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline28" class="outline-4">
<h4 id="orgheadline28"><span class="section-number-4">3.3.3</span> Path Utilities</h4>
<div class="outline-text-4" id="text-3-3-3">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/get-path-relative-to</span> <span style="color: #7388d6;">(</span>parent-path path<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>and <span style="color: #909183;">(</span>shen/internal/starts-with-path parent-path path<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span>shen/internal/path-slice path <span style="color: #333333; font-weight: bold;">0</span> <span style="color: #709870;">(</span>- <span style="color: #907373;">(</span>length path<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>length parent-path<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/starts-with-path</span> <span style="color: #7388d6;">(</span>parent-path path<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>and <span style="color: #909183;">(</span>&lt;= <span style="color: #709870;">(</span>length parent-path<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>length path<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span>equal parent-path
              <span style="color: #709870;">(</span>shen/internal/path-slice path
                               <span style="color: #907373;">(</span>- <span style="color: #6276ba;">(</span>length path<span style="color: #6276ba;">)</span>
                                  <span style="color: #6276ba;">(</span>length parent-path<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/get-path-parent</span> <span style="color: #7388d6;">(</span>path<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr path<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/path-slice</span> <span style="color: #7388d6;">(</span>path start <span style="color: #333333; font-style: italic;">&amp;optional</span> end<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>start-to-end <span style="color: #907373;">(</span>nthcdr start path<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>res<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> end
        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #907373;">(</span>i <span style="color: #6276ba;">(</span>- <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>&lt; end <span style="color: #887070;">(</span>length path<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                           end
                         <span style="color: #80a880;">(</span>length path<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                       start<span style="color: #6276ba;">)</span>
                    <span style="color: #6276ba;">(</span>nreverse res<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>push <span style="color: #6276ba;">(</span>nth i start-to-end<span style="color: #6276ba;">)</span> res<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      start-to-end<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline29" class="outline-4">
<h4 id="orgheadline29"><span class="section-number-4">3.3.4</span> AST Modification</h4>
<div class="outline-text-4" id="text-3-3-4">
<p>
Given an <code>ast</code>, some <code>paths</code>, destructively modify the ast with <code>tx-fn</code>. Note
that it starts with the deepest path first so as not to invalidate paths further
up the code tree.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/modify-ast</span> <span style="color: #7388d6;">(</span>ast paths tx-fn<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>deepest-first <span style="color: #907373;">(</span>sort paths <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #858580;">(</span>A B<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>&gt; <span style="color: #80a880;">(</span>length A<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>length B<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-ast ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #709870;">(</span>path deepest-first current-ast<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>setq current-ast
            <span style="color: #907373;">(</span>shen/internal/nset-element-at path ast <span style="color: #6276ba;">(</span>funcall tx-fn path ast<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
