melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline31" class="outline-3">
<h3 id="orgheadline31"><span class="section-number-3">3.4</span> List Filtering</h3>
<div class="outline-text-3" id="text-3-4">
<p>
A partition function that returns a pair of lists where
the first holds elements that pass and the second holds
those that fail:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/partition</span> <span style="color: #7388d6;">(</span>pred Xs<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>a<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>b<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #709870;">(</span>i <span style="color: #907373;">(</span>length Xs<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>list a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>push <span style="color: #907373;">(</span>nth i Xs<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>funcall pred <span style="color: #858580;">(</span>nth i Xs<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> a b<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
A filter function that returns the elements of <code>Xs</code> for which
<code>pred</code> holds but also optionally includes their index:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/filter</span> <span style="color: #7388d6;">(</span>pred Xs <span style="color: #333333; font-style: italic;">&amp;optional</span> include-index<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>accum<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #709870;">(</span>i <span style="color: #907373;">(</span>length Xs<span style="color: #907373;">)</span> accum<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>funcall pred <span style="color: #6276ba;">(</span>nth i Xs<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>push <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> include-index
                    <span style="color: #858580;">(</span>list <span style="color: #80a880;">(</span>nth i Xs<span style="color: #80a880;">)</span> i<span style="color: #858580;">)</span>
                  <span style="color: #858580;">(</span>nth i Xs<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                accum<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
A list search function that returns the index of the first
element for which <code>pred</code> holds:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/index-of</span> <span style="color: #7388d6;">(</span>pred Xs<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>found<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>not found<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>&lt; index <span style="color: #6276ba;">(</span>length Xs<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>funcall pred <span style="color: #858580;">(</span>nth index Xs<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>setq found index<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>setq index <span style="color: #6276ba;">(</span>+ index <span style="color: #333333; font-weight: bold;">1</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    found<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
A function that deletes the first occurrences of X
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/delete-first-eq</span> <span style="color: #7388d6;">(</span>needle Xs<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>index <span style="color: #907373;">(</span>shen/internal/index-of <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #858580;">(</span>X<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>eq X needle<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> Xs<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> index
        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>current-index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span>copy<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #6276ba;">(</span>&lt; current-index <span style="color: #858580;">(</span>length Xs<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
              <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>not <span style="color: #887070;">(</span>= current-index index<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>push <span style="color: #887070;">(</span>nth current-index Xs<span style="color: #887070;">)</span> copy<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>setq current-index <span style="color: #80a880;">(</span>1+ current-index<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>nreverse copy<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      Xs<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline42" class="outline-2">
<h2 id="orgheadline42"><span class="section-number-2">4</span> Rewriting The AST</h2>
