melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*List%20Filtering][List\ Filtering:1]]
(defun shen/internal/partition (pred Xs)
  (let ((a)
        (b))
    (dotimes (i (length Xs) (list a b))
      (push (nth i Xs)
            (if (funcall pred (nth i Xs)) a b)))))
;; List\ Filtering:1 ends here

;; [[file:shen-elisp.org::*List%20Filtering][List\ Filtering:2]]
(defun shen/internal/filter (pred Xs &optional include-index)
  (let ((accum))
    (dotimes (i (length Xs) accum)
      (if (funcall pred (nth i Xs))
          (push (if include-index
                    (list (nth i Xs) i)
                  (nth i Xs))
                accum)))))
;; List\ Filtering:2 ends here

;; [[file:shen-elisp.org::*List%20Filtering][List\ Filtering:3]]
(defun shen/internal/index-of (pred Xs)
  (let ((found)
        (index 0))
    (while (and (not found) (< index (length Xs)))
      (progn
        (if (funcall pred (nth index Xs))
            (setq found index))
        (setq index (+ index 1))))
    found))
;; List\ Filtering:3 ends here

;; [[file:shen-elisp.org::*List%20Filtering][List\ Filtering:4]]
(defun shen/internal/delete-first-eq (needle Xs)
  (let ((index (shen/internal/index-of (lambda (X) (eq X needle)) Xs)))
    (if index
        (let ((current-index 0)
              (copy))
          (while (< current-index (length Xs))
            (progn
              (if (not (= current-index index))
                  (push (nth current-index Xs) copy))
              (setq current-index (1+ current-index))))
          (nreverse copy))
      Xs)))
;; List\ Filtering:4 ends here
