melpa/working/shen-elisp/shen-elisp.org
** Prefixing Utilities
Elisp does not have namespaces so to insulate the rest of the user's Emacs image
the primitive functions, user-defined functions and variables are prefixed with ~shen/~.
Raw symbols are not touched since they can't harm existing Elisp code.

When decompiling Klambda to Elisp we need functions that prefix the appropriate
symbol with ~shen/~:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/prefix-symbol (X)
    (if (shen/symbol-p X)
        (intern (concat shen/prefix (format "%s" X)))
      X))
#+END_SRC

, detect if it has already has a prefixed:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/symbol-prefixed-p (X)
    (and (shen/symbol-p X) (string-prefix-p shen/prefix (symbol-name X))))

#+END_SRC

, and removes the prefix it for consumption by Shen:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/unprefix-symbol (X)
    (if (shen/internal/symbol-prefixed-p X)
        (intern (substring (symbol-name X) (length shen/prefix)))
      X))
#+END_SRC
