melpa/working/shen-elisp/shen-elisp.html
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline33" class="outline-3">
<h3 id="orgheadline33"><span class="section-number-3">4.1</span> Prefixing Utilities</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Elisp does not have namespaces so to insulate the rest of the user's Emacs image
the primitive functions, user-defined functions and variables are prefixed with <code>shen/</code>.
Raw symbols are not touched since they can't harm existing Elisp code.
</p>

<p>
When decompiling Klambda to Elisp we need functions that prefix the appropriate
symbol with <code>shen/</code>:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/prefix-symbol</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>shen/symbol-p X<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>concat shen/prefix <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s"</span> X<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    X<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
, detect if it has already has a prefixed:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/symbol-prefixed-p</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>and <span style="color: #909183;">(</span>shen/symbol-p X<span style="color: #909183;">)</span> <span style="color: #909183;">(</span>string-prefix-p shen/prefix <span style="color: #709870;">(</span>symbol-name X<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
, and removes the prefix it for consumption by Shen:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/unprefix-symbol</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>shen/internal/symbol-prefixed-p X<span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>substring <span style="color: #907373;">(</span>symbol-name X<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>length shen/prefix<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    X<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
