melpa/working/shen-elisp/shen-elisp.org
** Walking The AST
Before evaluating we walk the tree and return locations that require:
-  [[(namespace-only)]] : paths that need prefixing with ~shen/~,
-  [[(quote-only)]] : paths that need quoting only (since KLambda symbols do not need it but Elisp does)
-  [[(possibly-apply-function)]] : a list of *pairs* consisting of a path to the function at
  the head of the call and a list of symbols that have been passed in or bound via ~let~.

Internal to the walker, as each sublist is processed the following are tracked:
- [[(current-path)]] The path from root to the current point in the tree
- [[(current-list)]] The list currently being walked.
- [[(current-list-length)]] The length of the current list
- [[(current-index)]] The index of the current element in the current list.
- [[(locally-scoped-symbols)]] A list of symbols local to the current list
  that, when encountered, should remain unchanged since they were either passed
  in or bound via ~let~.
- [[(inner-lists)]] If a list is encountered when iterating over the current one,
  a path to that list and the set of symbols currently in scope are stored.
  Each inner list is processed in turn (possibly adding more). Iteration of the AST
  is over when there are no more inner lists left.

While iterating over a list the following cases are encountered:
- At the head of the list non- ~nil~ symbols need prefixing and quoting. Additionally:
  - if it is a [[(lambda form)]], the argument is added to the list of locally scoped variables
    and iteration moves to the body.
  - if we're looking at a [[(defun form)]], the second element of the
    form does not get quoted since it is the name of the function,
    and the arguments are added to local scope. before moving on to the
    body.
  - if it is a [[(let form)]], the name of the assignment is added to local scope and
    iteration moves to the assignment body.
  - any forms seen inside a [[(cond form)]] have to be treated differently. Specifically
    a symbol at the head of a predicate action pair is not function application so
    a [[(inner-lists-in-cond-form)][special flag]] is required to indicate that when iterating over the rest of a
    ~cond~ form.
  - otherwise it is a function call, and the path is stored along with the symbols in
    scope thus far.
  Symbols occuring anywhere else in the list are only quoted, not namespaced since they are not
  functions calls. They might be variables, but ~shen/get~ and ~shen/set~ take care of prefixing
  them so there's no need to worry about them here.
- All sublists encountered are stored for further processing. If they are at the head of the list
  and not part of ~cond~, they are also possible function calls.
#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
  (defun shen/internal/get-function-symbol-and-funcall-paths (ast)
    (let ((namespace-only)        ;; (ref:namespace-only)
          (quote-only)            ;; (ref:quote-only)
          (possibly-apply-function)) ;; (ref:possibly-apply-function)
      (if (not (consp ast))
          (if (shen/symbol-p ast)
              (list nil '(nil) '(nil) nil nil)
            (list nil nil nil nil nil))
        (let ((current-path)                     ;; (ref:current-path)
              (current-list ast)                 ;; (ref:current-list)
              (current-list-length (length ast)) ;; (ref:current-list-length)
              (current-index 0)                  ;; (ref:current-index)
              (locally-scoped-symbols)           ;; (ref:locally-scoped-symbols)
              (inner-lists)                      ;; (ref:inner-lists)
              (cond-predicate-action-p)
              (inner-lists-in-cond-form))        ;; (ref:inner-lists-in-cond-form)
          (while (or (< current-index current-list-length) ;; (ref:continue iterating)
                     inner-lists)
            (cond
             ((and (= current-index current-list-length) inner-lists) ;; (ref:sublists left)
              (progn
                (setq locally-scoped-symbols (nth 0 (car inner-lists)))
                (setq current-path (nth 1 (car inner-lists)))
                (setq cond-predicate-action-p (nth 2 (car inner-lists)))
                (setq inner-lists-in-cond-form nil)
                (setq inner-lists (cdr inner-lists))
                (setq current-list (shen/internal/get-element-at current-path ast))
                (setq current-index 0)
                (setq current-list-length (length current-list))))
             ((and (< current-index current-list-length)              ;; (ref:not a list)
                   (not (consp (nth current-index current-list))))
              (let ((current-token (nth current-index current-list)))
                (if (= 0 current-index)
                    (if (and (not (eq current-token 'nil))
                             (shen/symbol-p current-token))
                        (progn
                          (if (and (not (memq current-token locally-scoped-symbols))
                                   (not (eq current-token 'defun)))
                              (push (cons 0 current-path)
                                    namespace-only))
                          (cond
                           ((or (eq current-token 'lambda)
                                (eq current-token 'shen/lambda)) ;; (ref:lambda form)
                            (progn
                              (push (nth 1 current-list) locally-scoped-symbols)
                              (setq current-index 2)))
                           ((eq current-token 'defun) ;; (ref:defun form)
                            (progn
                              (push (cons 1 current-path) namespace-only)
                              (setq locally-scoped-symbols
                                    (append (nth 2 current-list) locally-scoped-symbols))
                              (setq current-index 3)))
                           ((or (eq current-token 'let)
                                (eq current-token 'shen/let))  ;; (ref:let form)
                            (progn
                              (push (nth 1 current-list) locally-scoped-symbols)
                              (setq current-index 2)))
                           ((or (eq current-token 'cond)
                                (eq current-token 'shen/cond)) ;; (ref:cond form)
                            (progn
                              (setq inner-lists-in-cond-form 't)
                              (setq current-index 1)))
                           (t
                            (progn
                              (if (not cond-predicate-action-p)
                                  (push (list (cons 0 current-path)
                                              (memq current-token locally-scoped-symbols))
                                        possibly-apply-function))
                              (setq current-index 1)))))
                      (setq current-index (1+ current-index)))
                  (if (and (not (eq current-token 'nil))
                           (shen/symbol-p current-token))
                      (progn
                        (if (not (memq current-token locally-scoped-symbols))
                            (push (cons current-index current-path)
                                  quote-only))
                        (setq current-index (1+ current-index)))
                    (setq current-index (1+ current-index))))))
             ((and (< current-index current-list-length)             ;; (ref:a sublist)
                   (consp (nth current-index current-list)))
              (progn
                (if (and (= 0 current-index) (not cond-predicate-action-p))
                    (push (list (cons current-index current-path)
                                nil)
                          possibly-apply-function))
                (push (list locally-scoped-symbols
                            (cons current-index current-path)
                            inner-lists-in-cond-form)
                      inner-lists)
                (setq current-index (+ current-index 1))))
             (t nil)))
          (list namespace-only quote-only possibly-apply-function))))) ;; (ref:returns)
#+END_SRC

