melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline3" class="outline-3">
<h3 id="orgheadline3"><span class="section-number-3">4.2</span> Walking The AST</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Before evaluating we walk the tree and return locations that require:
</p>
<ul class="org-ul">
<li><a href="#coderef-namespace-only"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-namespace-only');" onmouseout="CodeHighlightOff(this, 'coderef-namespace-only');">namespace-only</a> : paths that need prefixing with <code>shen/</code>,</li>
<li><a href="#coderef-quote-only"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-quote-only');" onmouseout="CodeHighlightOff(this, 'coderef-quote-only');">quote-only</a> : paths that need quoting only (since KLambda symbols do not need it but Elisp does)</li>
<li><a href="#coderef-possibly-apply-function"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-possibly-apply-function');" onmouseout="CodeHighlightOff(this, 'coderef-possibly-apply-function');">possibly-apply-function</a> : a list of <b>pairs</b> consisting of a path to the function at
the head of the call and a list of symbols that have been passed in or bound via <code>let</code>.</li>
</ul>

<p>
Internal to the walker, as each sublist is processed the following are tracked:
</p>
<ul class="org-ul">
<li><a href="#coderef-current-path"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-current-path');" onmouseout="CodeHighlightOff(this, 'coderef-current-path');">current-path</a> The path from root to the current point in the tree</li>
<li><a href="#coderef-current-list"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-current-list');" onmouseout="CodeHighlightOff(this, 'coderef-current-list');">current-list</a> The list currently being walked.</li>
<li><a href="#coderef-current-list-length"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-current-list-length');" onmouseout="CodeHighlightOff(this, 'coderef-current-list-length');">current-list-length</a> The length of the current list</li>
<li><a href="#coderef-current-index"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-current-index');" onmouseout="CodeHighlightOff(this, 'coderef-current-index');">current-index</a> The index of the current element in the current list.</li>
<li><a href="#coderef-locally-scoped-symbols"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-locally-scoped-symbols');" onmouseout="CodeHighlightOff(this, 'coderef-locally-scoped-symbols');">locally-scoped-symbols</a> A list of symbols local to the current list
that, when encountered, should remain unchanged since they were either passed
in or bound via <code>let</code>.</li>
<li><a href="#coderef-inner-lists"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-inner-lists');" onmouseout="CodeHighlightOff(this, 'coderef-inner-lists');">inner-lists</a> If a list is encountered when iterating over the current one,
a path to that list and the set of symbols currently in scope are stored.
Each inner list is processed in turn (possibly adding more). Iteration of the AST
is over when there are no more inner lists left.</li>
</ul>

<p>
While iterating over a list the following cases are encountered:
</p>
<ul class="org-ul">
<li><p>
At the head of the list non- <code>nil</code> symbols need prefixing and quoting. Additionally:
</p>
<ul class="org-ul">
<li>if it is a <a href="#coderef-lambda form"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-lambda form');" onmouseout="CodeHighlightOff(this, 'coderef-lambda form');">lambda form</a>, the argument is added to the list of locally scoped variables
and iteration moves to the body.</li>
<li>if we're looking at a <a href="#coderef-defun form"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-defun form');" onmouseout="CodeHighlightOff(this, 'coderef-defun form');">defun form</a>, the second element of the
form does not get quoted since it is the name of the function,
and the arguments are added to local scope. before moving on to the
body.</li>
<li>if it is a <a href="#coderef-let form"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-let form');" onmouseout="CodeHighlightOff(this, 'coderef-let form');">let form</a>, the name of the assignment is added to local scope and
iteration moves to the assignment body.</li>
<li>any forms seen inside a <a href="#coderef-cond form"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cond form');" onmouseout="CodeHighlightOff(this, 'coderef-cond form');">cond form</a> have to be treated differently. Specifically
a symbol at the head of a predicate action pair is not function application so
a <a href="#coderef-inner-lists-in-cond-form"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-inner-lists-in-cond-form');" onmouseout="CodeHighlightOff(this, 'coderef-inner-lists-in-cond-form');">special flag</a> is required to indicate that when iterating over the rest of a
<code>cond</code> form.</li>
<li>otherwise it is a function call, and the path is stored along with the symbols in
scope thus far.</li>
</ul>
<p>
Symbols occuring anywhere else in the list are only quoted, not namespaced since they are not
functions calls. They might be variables, but <code>shen/get</code> and <code>shen/set</code> take care of prefixing
them so there's no need to worry about them here.
</p></li>
<li>All sublists encountered are stored for further processing. If they are at the head of the list
and not part of <code>cond</code>, they are also possible function calls.</li>
</ul>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/get-function-symbol-and-funcall-paths</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
<span id="coderef-namespace-only" class="coderef-off">  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>namespace-only<span style="color: #709870;">)</span>        <span style="color: #d9d9d9;">;;</span> (namespace-only)</span>
<span id="coderef-quote-only" class="coderef-off">        <span style="color: #709870;">(</span>quote-only<span style="color: #709870;">)</span>            <span style="color: #d9d9d9;">;;</span> (quote-only)</span>
<span id="coderef-possibly-apply-function" class="coderef-off">        <span style="color: #709870;">(</span>possibly-apply-function<span style="color: #709870;">)</span><span style="color: #909183;">)</span> <span style="color: #d9d9d9;">;;</span> (possibly-apply-function)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>consp ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>shen/symbol-p ast<span style="color: #907373;">)</span>
            <span style="color: #907373;">(</span>list nil '<span style="color: #6276ba;">(</span>nil<span style="color: #6276ba;">)</span> '<span style="color: #6276ba;">(</span>nil<span style="color: #6276ba;">)</span> nil nil<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>list nil nil nil nil nil<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
<span id="coderef-current-path" class="coderef-off">      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>current-path<span style="color: #6276ba;">)</span>                     <span style="color: #d9d9d9;">;;</span> (current-path)</span>
<span id="coderef-current-list" class="coderef-off">            <span style="color: #6276ba;">(</span>current-list ast<span style="color: #6276ba;">)</span>                 <span style="color: #d9d9d9;">;;</span> (current-list)</span>
<span id="coderef-current-list-length" class="coderef-off">            <span style="color: #6276ba;">(</span>current-list-length <span style="color: #858580;">(</span>length ast<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #d9d9d9;">;;</span> (current-list-length)</span>
<span id="coderef-current-index" class="coderef-off">            <span style="color: #6276ba;">(</span>current-index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #6276ba;">)</span>                  <span style="color: #d9d9d9;">;;</span> (current-index)</span>
<span id="coderef-locally-scoped-symbols" class="coderef-off">            <span style="color: #6276ba;">(</span>locally-scoped-symbols<span style="color: #6276ba;">)</span>           <span style="color: #d9d9d9;">;;</span> (locally-scoped-symbols)</span>
<span id="coderef-inner-lists" class="coderef-off">            <span style="color: #6276ba;">(</span>inner-lists<span style="color: #6276ba;">)</span>                      <span style="color: #d9d9d9;">;;</span> (inner-lists)</span>
            <span style="color: #6276ba;">(</span>cond-predicate-action-p<span style="color: #6276ba;">)</span>
<span id="coderef-inner-lists-in-cond-form" class="coderef-off">            <span style="color: #6276ba;">(</span>inner-lists-in-cond-form<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>        <span style="color: #d9d9d9;">;;</span> (inner-lists-in-cond-form)</span>
<span id="coderef-continue iterating" class="coderef-off">        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #6276ba;">(</span>or <span style="color: #858580;">(</span>&lt; current-index current-list-length<span style="color: #858580;">)</span> <span style="color: #d9d9d9;">;;</span> (continue iterating)</span>
                   inner-lists<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
<span id="coderef-sublists left" class="coderef-off">           <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>and <span style="color: #887070;">(</span>= current-index current-list-length<span style="color: #887070;">)</span> inner-lists<span style="color: #80a880;">)</span> <span style="color: #d9d9d9;">;;</span> (sublists left)</span>
            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
              <span style="color: #887070;">(</span>setq locally-scoped-symbols <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> <span style="color: #7388d6;">(</span>car inner-lists<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq current-path <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #7388d6;">(</span>car inner-lists<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq cond-predicate-action-p <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> <span style="color: #7388d6;">(</span>car inner-lists<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq inner-lists-in-cond-form nil<span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq inner-lists <span style="color: #707183;">(</span>cdr inner-lists<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq current-list <span style="color: #707183;">(</span>shen/internal/get-element-at current-path ast<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq current-list-length <span style="color: #707183;">(</span>length current-list<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
<span id="coderef-not a list" class="coderef-off">           <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>and <span style="color: #887070;">(</span>&lt; current-index current-list-length<span style="color: #887070;">)</span>              <span style="color: #d9d9d9;">;;</span> (not a list)</span>
                 <span style="color: #887070;">(</span>not <span style="color: #707183;">(</span>consp <span style="color: #7388d6;">(</span>nth current-index current-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>current-token <span style="color: #7388d6;">(</span>nth current-index current-list<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #707183;">(</span>= <span style="color: #333333; font-weight: bold;">0</span> current-index<span style="color: #707183;">)</span>
                  <span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>and <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>eq current-token 'nil<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                           <span style="color: #909183;">(</span>shen/symbol-p current-token<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                      <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                        <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>memq current-token locally-scoped-symbols<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                                 <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>eq current-token 'defun<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                            <span style="color: #709870;">(</span>push <span style="color: #907373;">(</span>cons <span style="color: #333333; font-weight: bold;">0</span> current-path<span style="color: #907373;">)</span>
                                  namespace-only<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                        <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
                         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>or <span style="color: #6276ba;">(</span>eq current-token 'lambda<span style="color: #6276ba;">)</span>
<span id="coderef-lambda form" class="coderef-off">                              <span style="color: #6276ba;">(</span>eq current-token 'shen/lambda<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #d9d9d9;">;;</span> (lambda form)</span>
                          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                            <span style="color: #6276ba;">(</span>push <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #858580;">)</span> locally-scoped-symbols<span style="color: #6276ba;">)</span>
                            <span style="color: #6276ba;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">2</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
<span id="coderef-defun form" class="coderef-off">                         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq current-token 'defun<span style="color: #907373;">)</span> <span style="color: #d9d9d9;">;;</span> (defun form)</span>
                          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                            <span style="color: #6276ba;">(</span>push <span style="color: #858580;">(</span>cons <span style="color: #333333; font-weight: bold;">1</span> current-path<span style="color: #858580;">)</span> namespace-only<span style="color: #6276ba;">)</span>
                            <span style="color: #6276ba;">(</span>setq locally-scoped-symbols
                                  <span style="color: #858580;">(</span>append <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-list<span style="color: #80a880;">)</span> locally-scoped-symbols<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                            <span style="color: #6276ba;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">3</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>or <span style="color: #6276ba;">(</span>eq current-token 'let<span style="color: #6276ba;">)</span>
<span id="coderef-let form" class="coderef-off">                              <span style="color: #6276ba;">(</span>eq current-token 'shen/let<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>  <span style="color: #d9d9d9;">;;</span> (let form)</span>
                          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                            <span style="color: #6276ba;">(</span>push <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #858580;">)</span> locally-scoped-symbols<span style="color: #6276ba;">)</span>
                            <span style="color: #6276ba;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">2</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                         <span style="color: #709870;">(</span><span style="color: #907373;">(</span>or <span style="color: #6276ba;">(</span>eq current-token 'cond<span style="color: #6276ba;">)</span>
<span id="coderef-cond form" class="coderef-off">                              <span style="color: #6276ba;">(</span>eq current-token 'shen/cond<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #d9d9d9;">;;</span> (cond form)</span>
                          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                            <span style="color: #6276ba;">(</span>setq inner-lists-in-cond-form 't<span style="color: #6276ba;">)</span>
                            <span style="color: #6276ba;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">1</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                         <span style="color: #709870;">(</span>t
                          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                            <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>not cond-predicate-action-p<span style="color: #858580;">)</span>
                                <span style="color: #858580;">(</span>push <span style="color: #80a880;">(</span>list <span style="color: #887070;">(</span>cons <span style="color: #333333; font-weight: bold;">0</span> current-path<span style="color: #887070;">)</span>
                                            <span style="color: #887070;">(</span>memq current-token locally-scoped-symbols<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                                      possibly-apply-function<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                            <span style="color: #6276ba;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">1</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                    <span style="color: #7388d6;">(</span>setq current-index <span style="color: #909183;">(</span>1+ current-index<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                <span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #7388d6;">(</span>and <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>eq current-token 'nil<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                         <span style="color: #909183;">(</span>shen/symbol-p current-token<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                    <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                      <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>memq current-token locally-scoped-symbols<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                          <span style="color: #709870;">(</span>push <span style="color: #907373;">(</span>cons current-index current-path<span style="color: #907373;">)</span>
                                quote-only<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                      <span style="color: #909183;">(</span>setq current-index <span style="color: #709870;">(</span>1+ current-index<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                  <span style="color: #7388d6;">(</span>setq current-index <span style="color: #909183;">(</span>1+ current-index<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
<span id="coderef-a sublist" class="coderef-off">           <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>and <span style="color: #887070;">(</span>&lt; current-index current-list-length<span style="color: #887070;">)</span>             <span style="color: #d9d9d9;">;;</span> (a sublist)</span>
                 <span style="color: #887070;">(</span>consp <span style="color: #707183;">(</span>nth current-index current-list<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
              <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #707183;">(</span>and <span style="color: #7388d6;">(</span>= <span style="color: #333333; font-weight: bold;">0</span> current-index<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>not cond-predicate-action-p<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                  <span style="color: #707183;">(</span>push <span style="color: #7388d6;">(</span>list <span style="color: #909183;">(</span>cons current-index current-path<span style="color: #909183;">)</span>
                              nil<span style="color: #7388d6;">)</span>
                        possibly-apply-function<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>push <span style="color: #707183;">(</span>list locally-scoped-symbols
                          <span style="color: #7388d6;">(</span>cons current-index current-path<span style="color: #7388d6;">)</span>
                          inner-lists-in-cond-form<span style="color: #707183;">)</span>
                    inner-lists<span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>setq current-index <span style="color: #707183;">(</span>+ current-index <span style="color: #333333; font-weight: bold;">1</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
           <span style="color: #858580;">(</span>t nil<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
<span id="coderef-returns" class="coderef-off">        <span style="color: #907373;">(</span>list namespace-only quote-only possibly-apply-function<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> <span style="color: #d9d9d9;">;;</span> (returns)</span>
</pre>
</div>
</div>
</div>
