melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline34" class="outline-3">
<h3 id="orgheadline34"><span class="section-number-3">4.3</span> Function Application</h3>
<div class="outline-text-3" id="text-4-3">
<p>
Since KLambda supports partial application and Elisp does not function application is
tricky.
</p>

<p>
First we enumerate forms that may never be partially applied:
</p>
<div class="org-src-container">

<pre class="src src-elisp" id="orgsrcblock1"><span style="color: #707183;">(</span>setq shen/*primitive-macros*
      '<span style="color: #7388d6;">(</span>shen/if
        shen/and
        shen/or
        shen/cond
        shen/lambda
        shen/let
        defun
        shen/freeze
        shen/trap-error<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
The general strategy to rewriting KLambda function application to Elisp is to
first blindly apply the function as though all of its arguments are present and
only deal with errors if they occur.
</p>

<p>
In the case of a <a href="#coderef-higher-order function"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-higher-order function');" onmouseout="CodeHighlightOff(this, 'coderef-higher-order function');">higher-order function</a> if normal application fails, it is
applied <a href="#coderef-incremental application"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-incremental application');" onmouseout="CodeHighlightOff(this, 'coderef-incremental application');">incrementally</a> and barring that if the <code>arity</code> is known a <a href="#coderef-curried lambda"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-curried lambda');" onmouseout="CodeHighlightOff(this, 'coderef-curried lambda');">curried</a> version
is built and fed arguments one by one.
</p>

<p>
If it is <a href="#coderef-a list"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-a list');" onmouseout="CodeHighlightOff(this, 'coderef-a list');">a list</a> (which presumably evaluates to a function) since there is no
hope of knowing the arity only the incremental fallback is tried.
</p>

<p>
If the function has a <a href="#coderef-known arity"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-known arity');" onmouseout="CodeHighlightOff(this, 'coderef-known arity');">known arity</a> but is undersupplied with arguments a <a href="#coderef-curried lambda"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-curried lambda');" onmouseout="CodeHighlightOff(this, 'coderef-curried lambda');">curried</a>
lambda expression <b>and</b> the subsequent <code>funcalls</code> are constructed. No
fallback is required this time.
</p>

<p>
In the interests of efficiency when constructing the <a href="#coderef-curried lambda"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-curried lambda');" onmouseout="CodeHighlightOff(this, 'coderef-curried lambda');">lambda expression</a> as many
arguments as possible are applied in one fell swoop to cut down on the overhead
of incremental application. For example if a function <code>f</code> takes 3 arguments but
only 2 are supplied, the constructed expresssion looks like:
</p>
<pre class="example">
(lambda (A0 A1) (lambda (A2) (apply f (list A0 A1 A2))))
</pre>
<p>
instead of:
</p>
<pre class="example">
(lambda (A0) (lambda (A1) (lambda (A2) (apply f (list A0 A1 A2)))))
</pre>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/apply-function</span> <span style="color: #7388d6;">(</span>f args locally-scoped<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
<span id="coderef-higher-order function" class="coderef-off">   <span style="color: #909183;">(</span>locally-scoped       <span style="color: #d9d9d9;">;;</span> (higher-order function)</span>
    `<span style="color: #709870;">(</span>shen/internal/apply-higher-order-function ,f <span style="color: #907373;">(</span>list ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
<span id="coderef-a list" class="coderef-off">   <span style="color: #909183;">(</span><span style="color: #709870;">(</span>consp f<span style="color: #709870;">)</span>            <span style="color: #d9d9d9;">;;</span> (a list)</span>
    `<span style="color: #709870;">(</span>shen/internal/apply-function-expression ,f <span style="color: #907373;">(</span>list ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span>t
    <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>fboundp 'shen/arity<span style="color: #907373;">)</span>
<span id="coderef-known arity" class="coderef-off">        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>arity <span style="color: #80a880;">(</span>shen/internal/check-partial-application f <span style="color: #887070;">(</span>length args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #d9d9d9;">;;</span> (known arity)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>= arity <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #858580;">)</span>
              `<span style="color: #858580;">(</span>,f ,@args<span style="color: #858580;">)</span>
          `<span style="color: #858580;">(</span>shen/internal/apply-partially <span style="color: #80a880;">(</span>function ,f<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>list ,@args<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
      `<span style="color: #907373;">(</span>,f ,@args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/apply-higher-order-function</span> <span style="color: #7388d6;">(</span>f args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> apply-ex <span style="color: #909183;">(</span>apply f args<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>'wrong-number-of-arguments
     <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex
         <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>arity <span style="color: #80a880;">(</span>shen/internal/check-partial-application f <span style="color: #887070;">(</span>length args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>= arity <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> <span style="color: #80a880;">(</span>car apply-ex<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>cdr apply-ex<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>apply <span style="color: #80a880;">(</span>eval <span style="color: #887070;">(</span>shen/internal/make-lambda-expression f arity <span style="color: #707183;">(</span>length args<span style="color: #707183;">)</span><span style="color: #887070;">)</span> 't<span style="color: #80a880;">)</span> args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>'wrong-number-of-arguments
        <span style="color: #6276ba;">(</span>shen/internal/apply-incrementally f args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/apply-function-expression</span> <span style="color: #7388d6;">(</span>exp args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex <span style="color: #909183;">(</span>apply exp args<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>'wrong-number-of-arguments <span style="color: #709870;">(</span>shen/internal/apply-incrementally exp args<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/apply-partially</span> <span style="color: #7388d6;">(</span>f args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>arity <span style="color: #907373;">(</span>shen/internal/check-partial-application f <span style="color: #6276ba;">(</span>length args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>= arity <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>apply f args<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>apply <span style="color: #907373;">(</span>eval <span style="color: #6276ba;">(</span>shen/internal/make-lambda-expression f arity <span style="color: #858580;">(</span>length args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> 't<span style="color: #907373;">)</span> args<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span id="coderef-curried lambda" class="coderef-off"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/make-lambda-expression</span> <span style="color: #7388d6;">(</span>f arity num-args<span style="color: #7388d6;">)</span> <span style="color: #d9d9d9;">;;</span> (curried lambda)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>all-args <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>single-apply-args<span style="color: #858580;">)</span>
                         <span style="color: #858580;">(</span>blast-apply-args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                     <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">dotimes</span> <span style="color: #858580;">(</span>i arity <span style="color: #80a880;">(</span>list <span style="color: #887070;">(</span>reverse blast-apply-args<span style="color: #887070;">)</span>
                                             <span style="color: #887070;">(</span>reverse single-apply-args<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>push <span style="color: #80a880;">(</span>intern <span style="color: #887070;">(</span>format <span style="color: #666666;">"A%d"</span> i<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                             <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #887070;">(</span>and num-args <span style="color: #707183;">(</span>&lt; i num-args<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                 blast-apply-args
                               single-apply-args<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>blast-apply-args <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> all-args<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>single-apply-args <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> all-args<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>expression `<span style="color: #907373;">(</span>apply <span style="color: #6276ba;">(</span>function ,f<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>list ,@<span style="color: #858580;">(</span>append blast-apply-args single-apply-args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #709870;">(</span>arg <span style="color: #907373;">(</span>reverse single-apply-args<span style="color: #907373;">)</span> expression<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>setq expression `<span style="color: #907373;">(</span>shen/lambda ,arg ,expression<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> blast-apply-args
        `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> ,<span style="color: #907373;">(</span>reverse blast-apply-args<span style="color: #907373;">)</span> ,expression<span style="color: #709870;">)</span>
      expression<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span id="coderef-incremental application" class="coderef-off"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/apply-incrementally</span> <span style="color: #7388d6;">(</span>f args<span style="color: #7388d6;">)</span> <span style="color: #d9d9d9;">;;</span> (incremental application)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>result f<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-args args<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">while</span> current-args
      <span style="color: #709870;">(</span>setq result <span style="color: #907373;">(</span>funcall result <span style="color: #6276ba;">(</span>car current-args<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>setq current-args <span style="color: #907373;">(</span>cdr current-args<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    result<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/check-partial-application</span> <span style="color: #7388d6;">(</span>f num-args<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>arity <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex <span style="color: #6276ba;">(</span>shen/arity <span style="color: #858580;">(</span>shen/internal/unprefix-symbol f<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>'error <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>eq <span style="color: #333333; font-weight: bold;">-1</span> arity<span style="color: #907373;">)</span> <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>= arity num-args<span style="color: #907373;">)</span> <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #907373;">(</span>&gt; num-args arity<span style="color: #907373;">)</span> <span style="color: #333333; font-weight: bold;">-1</span><span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>t arity<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
