melpa/working/shen-elisp/shen-elisp.html
<ol class="org-ol"><li><a id="orgheadline35"></a>Detecting Recursive Calls<br  /><div class="outline-text-5" id="text-4-4-0-1">
<p>
The function follows the same basic template as searching for <a href="#orgheadline27">the first
occurrence</a> of something in the AST but instead of stopping at the first
encounter keeps a <a href="#coderef-tail-calls-found"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-tail-calls-found');" onmouseout="CodeHighlightOff(this, 'coderef-tail-calls-found');">tally</a> of paths to all tail calls.
</p>

<p>
In the case where a <code>cond</code> is encountered all the predicate action pairs where
the action <a href="#coderef-cond-filter"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-cond-filter');" onmouseout="CodeHighlightOff(this, 'coderef-cond-filter');">can't be a function call</a> are filtered out and the index of each
action is added to the list of forms that <a href="#coderef-lists-left-to-search"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-lists-left-to-search');" onmouseout="CodeHighlightOff(this, 'coderef-lists-left-to-search');">might contain a tail call</a>.
</p>

<p>
In an <code>if</code> since the 2nd element is the predicate only the 3rd and possibly the
4th elements (if it exists) of the list are checked. In <code>trap-error</code> both the
action and the fallback may contain a tail call. In a <code>lambda</code>, <code>let</code> and
<code>defun</code> forms only the bodies may contain a tail call. In all other cases jump
to the end of the list and continue searching.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/find-recursive-call-paths</span> <span style="color: #7388d6;">(</span>function-name args ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>not <span style="color: #709870;">(</span>consp ast<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      'shen/not-found
<span id="coderef-lists-left-to-search" class="coderef-off">    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>lists-left-to-search `<span style="color: #6276ba;">(</span><span style="color: #858580;">(</span><span style="color: #80a880;">()</span> ,ast<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #d9d9d9;">;;</span> (lists-left-to-search)</span>
<span id="coderef-tail-calls-found" class="coderef-off">          <span style="color: #907373;">(</span>found 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>  <span style="color: #d9d9d9;">;;</span> (tail-calls-found)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">while</span> lists-left-to-search
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>search-candidate <span style="color: #80a880;">(</span>car lists-left-to-search<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>search-candidate-path <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> search-candidate<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>current-list <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> search-candidate<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>current-list-length <span style="color: #80a880;">(</span>length current-list<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>current-head <span style="color: #80a880;">(</span>car current-list<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
<span id="coderef-push-if-list" class="coderef-off">               <span style="color: #858580;">(</span>push-if-list     <span style="color: #d9d9d9;">;;</span> (push-if-list)</span>
                <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #887070;">(</span>indexes<span style="color: #887070;">)</span>
                  <span style="color: #887070;">(</span>mapc
                   <span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #7388d6;">(</span>index<span style="color: #7388d6;">)</span>
                     <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>consp <span style="color: #709870;">(</span>nth index current-list<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
                         <span style="color: #909183;">(</span>setq lists-left-to-search
                               <span style="color: #709870;">(</span>append lists-left-to-search
                                       <span style="color: #907373;">(</span>list
                                        <span style="color: #6276ba;">(</span>list <span style="color: #858580;">(</span>cons index search-candidate-path<span style="color: #858580;">)</span>
                                              <span style="color: #858580;">(</span>nth index current-list<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                   indexes<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
            <span style="color: #858580;">(</span>setq lists-left-to-search <span style="color: #80a880;">(</span>cdr lists-left-to-search<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">cond</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>and <span style="color: #707183;">(</span>eq current-head function-name<span style="color: #707183;">)</span>
                        <span style="color: #707183;">(</span>= <span style="color: #7388d6;">(</span>length <span style="color: #909183;">(</span>cdr current-list<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>length args<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #707183;">(</span>not <span style="color: #7388d6;">(</span>consp found<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                       <span style="color: #707183;">(</span>setq found <span style="color: #7388d6;">(</span>list search-candidate-path<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                     <span style="color: #707183;">(</span>push search-candidate-path found<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>eq current-head 'shen/cond<span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                     <span style="color: #707183;">(</span>mapc
                      <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #909183;">(</span>action-index-pair<span style="color: #909183;">)</span>
                        <span style="color: #909183;">(</span>setq lists-left-to-search
                              <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>path-to-action
                                     <span style="color: #858580;">(</span>append <span style="color: #80a880;">(</span>list <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #887070;">(</span>1+ <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> action-index-pair<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                                             search-candidate-path<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                                <span style="color: #907373;">(</span>append lists-left-to-search
                                        <span style="color: #6276ba;">(</span>list
                                         <span style="color: #858580;">(</span>list path-to-action
                                               <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> action-index-pair<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span>
                      <span style="color: #7388d6;">(</span>mapcar
                       <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>predicate-action-index<span style="color: #709870;">)</span>
                         <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> predicate-action-index<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
                               <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> predicate-action-index<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
<span id="coderef-cond-filter" class="coderef-off">                       <span style="color: #909183;">(</span>shen/internal/filter  <span style="color: #d9d9d9;">;;</span> (cond-filter)</span>
                        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #907373;">(</span>predicate-action-pair<span style="color: #907373;">)</span>
                          <span style="color: #907373;">(</span>consp <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> predicate-action-pair<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                        <span style="color: #709870;">(</span>cdr current-list<span style="color: #709870;">)</span>
                        't<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>eq current-head 'shen/if<span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #707183;">(</span>= <span style="color: #333333; font-weight: bold;">4</span> current-list-length<span style="color: #707183;">)</span>
                       <span style="color: #707183;">(</span>funcall push-if-list '<span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">2</span> <span style="color: #333333; font-weight: bold;">3</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                     <span style="color: #707183;">(</span>funcall push-if-list '<span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">2</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>eq current-head 'shen/trap-error<span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span>funcall push-if-list '<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">1</span> <span style="color: #333333; font-weight: bold;">2</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>or <span style="color: #707183;">(</span>eq current-head 'shen/let<span style="color: #707183;">)</span>
                       <span style="color: #707183;">(</span>eq current-head 'defun<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span>funcall push-if-list '<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">3</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>eq current-head 'shen/lambda<span style="color: #887070;">)</span>
                   <span style="color: #887070;">(</span>funcall push-if-list '<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">2</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                  <span style="color: #80a880;">(</span>t <span style="color: #887070;">(</span>funcall push-if-list <span style="color: #707183;">(</span>list <span style="color: #7388d6;">(</span>- current-list-length <span style="color: #333333; font-weight: bold;">1</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      found<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li>
