melpa/working/shen-elisp/shen-elisp.html
<li><a id="orgheadline37"></a>Getting the Tail Calls<br  /><div class="outline-text-5" id="text-4-4-0-3">
<p>
Now that we can get a list of recursive calls and their surrounding context
a proper tail call is simply one without any context, i.e it is the last thing
left to do.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/get-tail-call-paths</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>function-name <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>args <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>body <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">3</span> ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>recursive-call-paths <span style="color: #907373;">(</span>shen/internal/find-recursive-call-paths function-name args body<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>eq recursive-call-paths 'shen/not-found<span style="color: #709870;">)</span>
        'shen/not-found
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>accum<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #6276ba;">(</span>tail-call-path recursive-call-paths <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> accum <span style="color: #80a880;">(</span>reverse accum<span style="color: #80a880;">)</span> 'shen/not-found<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>context <span style="color: #887070;">(</span>shen/start-of-function-chain tail-call-path body<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #80a880;">(</span>equal context tail-call-path<span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>push <span style="color: #887070;">(</span>append tail-call-path <span style="color: #707183;">(</span>list <span style="color: #333333; font-weight: bold;">3</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span> accum<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div></li></ol>
</div>
<div id="outline-container-orgheadline39" class="outline-3">
<h3 id="orgheadline39"><span class="section-number-3">4.5</span> Generating A TCO'ed Function</h3>
<div class="outline-text-3" id="text-4-5">
<p>
Finally we can optimize tail calls into trampolines. The body of the trampoline
matches the body of unoptimized function except that tail calls are replaced by
vector that holds the arguments to the recursive call fully evaluated:
</p>

<p>
An Elisp vector is chosen because KLambda code can never return one and so
uniquely identifies an intermediate return value from a recursive function.
KLambda vectors are represented by <a href="#orgheadline17">hash-tables</a>
</p>

<p>
A while loop extracts the arguments from the struct and passes them back into
the trampoline until it returns something other than the struct. This is the return
value.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/trampoline-body</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>args <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>body <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">3</span> ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tail-trampoline <span style="color: #907373;">(</span>make-symbol <span style="color: #666666;">"tail-trampoline"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    `<span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cl-flet</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>,tail-trampoline ,args ,body<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>result <span style="color: #858580;">(</span>funcall <span style="color: #80a880;">(</span>function ,tail-trampoline<span style="color: #80a880;">)</span> ,@args<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #6276ba;">(</span>vectorp result<span style="color: #6276ba;">)</span>
           <span style="color: #6276ba;">(</span>setq result <span style="color: #858580;">(</span>apply <span style="color: #80a880;">(</span>function ,tail-trampoline<span style="color: #80a880;">)</span> <span style="color: #80a880;">(</span>aref result <span style="color: #333333; font-weight: bold;">0</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
         result<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
This overall approach owes a lot to Wilfred Hughes' excellent <a href="https://github.com/Wilfred/tco.el">tco.el</a>. The
essential difference is that he returns a function instead of a struct. The
latter approach guards against the possibility that if the final return value is
a function there would be no way to tell when recursion terminated.
</p>
</div>
</div>
