melpa/working/shen-elisp/shen-primitives.el
  (let* ((function-name (nth 1 ast))
         (args (nth 2 ast))
         (body (nth 3 ast))
         (recursive-call-paths (shen/internal/find-recursive-call-paths function-name args body)))
    (if (eq recursive-call-paths 'shen/not-found)
        'shen/not-found
      (let ((accum))
        (dolist (tail-call-path recursive-call-paths (if accum (reverse accum) 'shen/not-found))
          (let* ((context (shen/start-of-function-chain tail-call-path body)))
            (if (equal context tail-call-path)
                (push (append tail-call-path (list 3)) accum))))))))
;; Getting\ the\ Tail\ Calls:1 ends here

;; [[file:shen-elisp.org::*Generating%20A%20TCO'ed%20Function][Generating\ A\ TCO\'ed\ Function:1]]
(defun shen/trampoline-body (ast)
  (let* ((args (nth 2 ast))
         (body (nth 3 ast))
         (tail-trampoline (make-symbol "tail-trampoline")))
    `(cl-flet ((,tail-trampoline ,args ,body))
       (let ((result (funcall (function ,tail-trampoline) ,@args)))
         (while (vectorp result)
           (setq result (apply (function ,tail-trampoline) (aref result 0))))
         result))))
;; Generating\ A\ TCO\'ed\ Function:1 ends here

;; [[file:shen-elisp.org::*Modifying%20The%20AST][Modifying\ The\ AST:1]]
(defun shen/internal/parse-ast (ast)
  (if (not (consp ast))
