melpa/working/shen-elisp/shen-primitives.el
      (if (shen/symbol-p ast) (list 'quote ast) ast)
   (let* ((function-and-symbol-paths (shen/internal/get-function-symbol-and-funcall-paths ast)) ;;; (ref:paths)
         (namespace-only (nth 0 function-and-symbol-paths))
         (quote-only (nth 1 function-and-symbol-paths))
         (possibly-apply-function (nth 2 function-and-symbol-paths))
         (current-ast ast))
    (progn
      (shen/internal/namespace-and-quote current-ast namespace-only quote-only) ;;; (ref:quote and namespace)
      (let ((apply-function (shen/internal/filter
                             (lambda (path-local)
                               (let ((token (shen/internal/get-element-at (nth 0 path-local) ast)))
                                 (not (memq token shen/*primitive-macros*))))
                             possibly-apply-function)))
        (if (eq (car current-ast) 'defun) ;;; (ref:defun form)
            (let* ((tail-call-paths (shen/internal/get-tail-call-paths ast)))
              (if (not (eq tail-call-paths 'shen/not-found))
                  (let ((not-in-tail-call apply-function)
                        (in-tail-call))
                    (progn
                      (dolist (path tail-call-paths nil)
                        (let* ((tco-non-tco-pair ;;; (ref:inside the recursive call)
                                (shen/internal/partition
                                 (lambda (apply-function-path-local)
                                   (shen/internal/starts-with-path path (nth 0 apply-function-path-local)))
                                 not-in-tail-call))
                               (funcalled-tco
                                (let* ((normalized-paths
                                        (shen/internal/filter
                                         (lambda (path-local) (not (equal (nth 0 path-local) '(0))))
                                         (mapcar
                                          (lambda (in-tco-path-local)
                                            (list
                                             (shen/internal/get-path-relative-to path (nth 0 in-tco-path-local))
                                             (nth 1 in-tco-path-local)))
                                          (nth 0 tco-non-tco-pair))))
                                       (tail-call (shen/internal/get-element-at path current-ast)))
                                  (list
                                   path
                                   `(vector (list ,@(cdr (shen/internal/add-funcalls tail-call normalized-paths)))))))) ;;; (ref:package up the arguments)
                          (progn
                            (setq not-in-tail-call (nth 1 tco-non-tco-pair))
                            (push funcalled-tco in-tail-call))))
                      (dolist (path-tail-call in-tail-call nil)  ;;; (ref:Sub in the recurs marker)
                        (shen/internal/modify-ast current-ast (list (nth 0 path-tail-call))
                                         (lambda (path current-ast) (nth 1 path-tail-call))))
                      (setq current-ast (shen/internal/add-funcalls current-ast not-in-tail-call)) ;;; (ref:rest of the function applications)
                      (setq current-ast `(defun ,(nth 1 current-ast) ,(nth 2 current-ast) ,(shen/trampoline-body current-ast))))) ;;; (ref:write out the defun)
                (setq current-ast (shen/internal/add-funcalls current-ast apply-function)))
              current-ast)
          (progn
            (setq current-ast (shen/internal/add-funcalls current-ast apply-function))
            current-ast)))))))
;; Modifying\ The\ AST:1 ends here

;; [[file:shen-elisp.org::*Modifying%20The%20AST][Modifying\ The\ AST:2]]
(defun shen/internal/namespace-and-quote (ast namespace-only-paths quote-only-paths)
  (progn
    (shen/internal/modify-ast ast namespace-only-paths
                     (lambda (path ast)
                       (let ((element (shen/internal/get-element-at path ast)))
                         (if (not (shen/internal/symbol-prefixed-p element))
                             (shen/internal/prefix-symbol (shen/internal/get-element-at path ast))
                           element))))
    (shen/internal/modify-ast ast quote-only-paths
                     (lambda (path ast)
                       (list 'quote (shen/internal/get-element-at path ast))))
    ast))
;; Modifying\ The\ AST:2 ends here

;; [[file:shen-elisp.org::*Modifying%20The%20AST][Modifying\ The\ AST:3]]
(defun shen/internal/add-funcalls (ast apply-function)
  (let ((paths-only (mapcar (lambda (path-local) (nth 0 path-local)) apply-function)))
    (shen/internal/modify-ast ast (mapcar #'shen/internal/get-path-parent paths-only)
                     (lambda (path ast)
                       (let* ((current-funcalled-list (shen/internal/get-element-at path ast))
                              (function-name (car current-funcalled-list))
                              (function-arguments (cdr current-funcalled-list)))
                         (shen/internal/apply-function
                          function-name
                          function-arguments
                          (shen/internal/lookup-with-default (cons 0 path) apply-function nil)))))))
;; Modifying\ The\ AST:3 ends here
