melpa/working/shen-elisp/shen-elisp.org
** (Unused) Isolating and Filling
I was going to do something clever with the function application context but that didn't work
so these functions are unused for now.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/make-holed-context (tail-call-path function-chain-path ast)
    (let* ((function-chain (shen/internal/get-element-at function-chain-path ast))
           (tail-call (shen/internal/get-element-at tail-call-path ast))
           (tail-call-relative-path
            (shen/internal/path-slice tail-call-path 0
                    (- (length tail-call-path)
                       (length function-chain-path)))))
      (shen/internal/nset-element-at tail-call-relative-path function-chain 'shen/__hole__)))

  (defun shen/used-in-context (context locally-scoped)
    (mapcar (lambda (symbol-index-pair)
              (nth 1 symbol-index-pair))
            (shen/internal/filter
             (lambda (v)
               (not (eq 'shen/not-found (shen/internal/find-all v context))))
             locally-scoped
             't)))

  (defun shen/substitute-in-context (context locally-scoped-alist)
    (let ((current-context context))
      (dolist (locally-scoped-pair locally-scoped-alist current-context)
        (let* ((name (nth 0 locally-scoped-pair))
               (value (nth 1 locally-scoped-pair))
               (all-matching-paths (shen/internal/find-all name current-context)))
          (if (not (eq all-matching-paths 'shen/not-found))
              (dolist (path all-matching-paths nil)
                (shen/internal/nset-element-at path current-context value)))))))
#+END_SRC

* Optimizations
