melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline41" class="outline-3">
<h3 id="orgheadline41"><span class="section-number-3">4.7</span> (Unused) Isolating and Filling</h3>
<div class="outline-text-3" id="text-4-7">
<p>
I was going to do something clever with the function application context but that didn't work
so these functions are unused for now.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/make-holed-context</span> <span style="color: #7388d6;">(</span>tail-call-path function-chain-path ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>function-chain <span style="color: #907373;">(</span>shen/internal/get-element-at function-chain-path ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tail-call <span style="color: #907373;">(</span>shen/internal/get-element-at tail-call-path ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>tail-call-relative-path
          <span style="color: #907373;">(</span>shen/internal/path-slice tail-call-path <span style="color: #333333; font-weight: bold;">0</span>
                  <span style="color: #6276ba;">(</span>- <span style="color: #858580;">(</span>length tail-call-path<span style="color: #858580;">)</span>
                     <span style="color: #858580;">(</span>length function-chain-path<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/internal/nset-element-at tail-call-relative-path function-chain 'shen/__hole__<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/used-in-context</span> <span style="color: #7388d6;">(</span>context locally-scoped<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>mapcar <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>symbol-index-pair<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> symbol-index-pair<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>shen/internal/filter
           <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #907373;">(</span>v<span style="color: #907373;">)</span>
             <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>eq 'shen/not-found <span style="color: #858580;">(</span>shen/internal/find-all v context<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
           locally-scoped
           't<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/substitute-in-context</span> <span style="color: #7388d6;">(</span>context locally-scoped-alist<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>current-context context<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #709870;">(</span>locally-scoped-pair locally-scoped-alist current-context<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>name <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> locally-scoped-pair<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>value <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> locally-scoped-pair<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>all-matching-paths <span style="color: #858580;">(</span>shen/internal/find-all name current-context<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>not <span style="color: #858580;">(</span>eq all-matching-paths 'shen/not-found<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #858580;">(</span>path all-matching-paths nil<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>shen/internal/nset-element-at path current-context value<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
