melpa/working/shen-elisp/shen-elisp.org
** Consolidate Call Chains
KLambda code is rife with argument chains such as ~(cons x (cons y
nil))~ for list building and ~(@s "x" (@s "y" ""))~ for string concatenation
which can easily be rewritten to more efficient variadic Elisp functions.

A generic function that takes ~matcher-fn~ which finds these chains, a
~collector-fn~ that accumulates them and ~tx-fn~ which rewrites:
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/consolidate (ast matcher-fn collector-fn tx-fn)
    (let* ((current-ast ast)
           (location-containing-chain
            (shen/internal/list-containing-first-occurrence-of matcher-fn ast)))
      (while (not (eq location-containing-chain 'shen/not-found))
        (let ((current-chain (shen/internal/get-element-at location-containing-chain current-ast))
              (accum))
          (progn
            (while (funcall matcher-fn current-chain)
              (let ((collected (funcall collector-fn accum current-chain)))
                (setq accum (nth 0 collected))
                (setq current-chain (nth 1 collected))))
            (setq current-ast
                  (shen/internal/nset-element-at
                   location-containing-chain
                   current-ast
                   (funcall tx-fn accum current-chain)))
            (setq location-containing-chain
                  (shen/internal/list-containing-first-occurrence-of matcher-fn current-ast)))))
      current-ast))
#+END_SRC
** Consolidate Cons
Convert ~(cons a (cons b (blah)))~ into ~(append (list 'a 'b) (blah))~
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/consolidate-cons (ast)
    (shen/internal/consolidate
     ast
     (lambda (current-list)
       (and current-list
            (consp current-list)
            (eq 3 (length current-list))
            (eq (nth 0 current-list) 'shen/cons)))
     (lambda (accum current-chain)
       (list (cons (nth 1 current-chain) accum)
             (nth 2 current-chain)))
     (lambda (accum remaining-chain)
       (if (eq remaining-chain 'nil)
           (cons 'list (reverse accum))
         (list 'append (cons 'list (reverse accum)) remaining-chain)))))
#+END_SRC
