melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline48" class="outline-2">
<h2 id="orgheadline48"><span class="section-number-2">5</span> Optimizations</h2>
<div class="outline-text-2" id="text-5">
</div><div id="outline-container-orgheadline43" class="outline-3">
<h3 id="orgheadline43"><span class="section-number-3">5.1</span> Consolidate Call Chains</h3>
<div class="outline-text-3" id="text-5-1">
<p>
KLambda code is rife with argument chains such as <code>(cons x (cons y
nil))</code> for list building and <code>(@s "x" (@s "y" ""))</code> for string concatenation
which can easily be rewritten to more efficient variadic Elisp functions.
</p>

<p>
A generic function that takes <code>matcher-fn</code> which finds these chains, a
<code>collector-fn</code> that accumulates them and <code>tx-fn</code> which rewrites:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/consolidate</span> <span style="color: #7388d6;">(</span>ast matcher-fn collector-fn tx-fn<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>current-ast ast<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>location-containing-chain
          <span style="color: #907373;">(</span>shen/internal/list-containing-first-occurrence-of matcher-fn ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>eq location-containing-chain 'shen/not-found<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>current-chain <span style="color: #858580;">(</span>shen/internal/get-element-at location-containing-chain current-ast<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>accum<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #858580;">(</span>funcall matcher-fn current-chain<span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>collected <span style="color: #707183;">(</span>funcall collector-fn accum current-chain<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
              <span style="color: #80a880;">(</span>setq accum <span style="color: #887070;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> collected<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
              <span style="color: #80a880;">(</span>setq current-chain <span style="color: #887070;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> collected<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>setq current-ast
                <span style="color: #858580;">(</span>shen/internal/nset-element-at
                 location-containing-chain
                 current-ast
                 <span style="color: #80a880;">(</span>funcall tx-fn accum current-chain<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span>setq location-containing-chain
                <span style="color: #858580;">(</span>shen/internal/list-containing-first-occurrence-of matcher-fn current-ast<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    current-ast<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline12" class="outline-3">
<h3 id="orgheadline12"><span class="section-number-3">5.2</span> Consolidate Cons</h3>
<div class="outline-text-3" id="text-5-2">
<p>
Convert <code>(cons a (cons b (blah)))</code> into <code>(append (list 'a 'b) (blah))</code>
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/consolidate-cons</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>and current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #333333; font-weight: bold;">3</span> <span style="color: #6276ba;">(</span>length current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> current-list<span style="color: #6276ba;">)</span> 'shen/cons<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum current-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>cons <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-chain<span style="color: #6276ba;">)</span> accum<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>eq remaining-chain 'nil<span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>cons 'list <span style="color: #6276ba;">(</span>reverse accum<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>list 'append <span style="color: #6276ba;">(</span>cons 'list <span style="color: #858580;">(</span>reverse accum<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> remaining-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
