melpa/working/shen-elisp/shen-elisp.org
** Consolidate @s
Convert ~(@s "a" (@s "b" (blah)))~ into ~(concat (concat "a" "b") (blah))~
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/consolidate-@s (ast)
    (shen/internal/consolidate
     ast
     (lambda (current-list)
       (and current-list
            (consp current-list)
            (eq 3 (length current-list))
            (eq (nth 0 current-list) 'shen/@s)))
     (lambda (accum current-chain)
       (list (cons (nth 1 current-chain) accum)
             (nth 2 current-chain)))
     (lambda (accum remaining-chain)
       (list 'concat (cons 'concat (reverse accum)) remaining-chain))))
#+END_SRC
** Consolidate tl
Convert ~(tl (tl (tl Xs)))~ to ~(nthcdr 3 Xs)~
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/consolidate-tl (ast)
    (shen/internal/consolidate
     ast
     (lambda (current-list)
       (and current-list
            (consp current-list)
            (eq 2 (length current-list))
            (eq (nth 0 current-list) 'shen/tl)))
     (lambda (accum current-chain)
       (list (if (not accum) 1 (+ accum 1))
             (nth 1 current-chain)))
     (lambda (accum remaining-chain)
       (list 'nthcdr accum remaining-chain))))
#+END_SRC
** Add 1+'s
Convert ~(+ X 1)~ or ~(+ 1 X)~ to ~(1+ X)~
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/add-1+ (ast)
    (shen/internal/consolidate
     ast
     (lambda (current-list)
       (and current-list
            (consp current-list)
            (eq 3 (length current-list))
            (and (eq (nth 0 current-list) 'shen/+)
                 (or (eq (nth 1 current-list) 1)
                     (eq (nth 2 current-list) 1)))))
     (lambda (accum current-list)
       (if (eq (nth 1 current-list) 1)
           (list (nth 2 current-list) nil)
         (list (nth 1 current-list) nil)))
     (lambda (accum remaining-chain)
       (list '1+ accum))))
#+END_SRC
