melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline44" class="outline-3">
<h3 id="orgheadline44"><span class="section-number-3">5.3</span> Consolidate @s</h3>
<div class="outline-text-3" id="text-5-3">
<p>
Convert <code>(@s "a" (@s "b" (blah)))</code> into <code>(concat (concat "a" "b") (blah))</code>
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/consolidate-@s</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>and current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #333333; font-weight: bold;">3</span> <span style="color: #6276ba;">(</span>length current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> current-list<span style="color: #6276ba;">)</span> 'shen/@s<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum current-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span>cons <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-chain<span style="color: #6276ba;">)</span> accum<span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list 'concat <span style="color: #907373;">(</span>cons 'concat <span style="color: #6276ba;">(</span>reverse accum<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> remaining-chain<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline45" class="outline-3">
<h3 id="orgheadline45"><span class="section-number-3">5.4</span> Consolidate tl</h3>
<div class="outline-text-3" id="text-5-4">
<p>
Convert <code>(tl (tl (tl Xs)))</code> to <code>(nthcdr 3 Xs)</code>
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/consolidate-tl</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>and current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #333333; font-weight: bold;">2</span> <span style="color: #6276ba;">(</span>length current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> current-list<span style="color: #6276ba;">)</span> 'shen/tl<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum current-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #6276ba;">(</span>not accum<span style="color: #6276ba;">)</span> <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #6276ba;">(</span>+ accum <span style="color: #333333; font-weight: bold;">1</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
           <span style="color: #907373;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-chain<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list 'nthcdr accum remaining-chain<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline46" class="outline-3">
<h3 id="orgheadline46"><span class="section-number-3">5.5</span> Add 1+'s</h3>
<div class="outline-text-3" id="text-5-5">
<p>
Convert <code>(+ X 1)</code> or <code>(+ 1 X)</code> to <code>(1+ X)</code>
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/add-1+</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>and current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #333333; font-weight: bold;">3</span> <span style="color: #6276ba;">(</span>length current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>eq <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> current-list<span style="color: #858580;">)</span> 'shen/+<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>or <span style="color: #858580;">(</span>eq <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #80a880;">)</span> <span style="color: #333333; font-weight: bold;">1</span><span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>eq <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-list<span style="color: #80a880;">)</span> <span style="color: #333333; font-weight: bold;">1</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>eq <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #6276ba;">)</span> <span style="color: #333333; font-weight: bold;">1</span><span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>list <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-list<span style="color: #6276ba;">)</span> nil<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>list <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #6276ba;">)</span> nil<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>list '1+ accum<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
