melpa/working/shen-elisp/shen-elisp.org
** Nil Comparisons To Null
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/nil-to-null (ast)
    (shen/internal/consolidate
     ast
     (lambda (current-list)
       (and current-list
            (consp current-list)
            (eq 3 (length current-list))
            (and (eq (nth 0 current-list) 'shen/=)
                 (or (eq (nth 1 current-list) 'nil)
                     (eq (nth 2 current-list) 'nil)))))
     (lambda (accum current-list)
       (if (eq (nth 1 current-list) 'nil)
           (list (nth 2 current-list) nil)
         (list (nth 1 current-list) nil)))
     (lambda (accum remaining-chain)
       `(shen/predicate->shen (null ,accum)))))
#+END_SRC

* Evaluate KLambda
Now that the mechanisms for [[Function Application][applying functions]], and [[Modifying The AST][quoting/namespacing]] are in place
converting KLambda to Elisp is just a couple of function calls.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/internal/kl-to-elisp (Kl)
    (shen/internal/nil-to-null
     (shen/internal/add-1+
      (shen/internal/consolidate-tl
       (shen/internal/consolidate-@s
        (shen/internal/consolidate-cons (shen/internal/parse-ast Kl)))))))
#+END_SRC

Evaluating KLambda to Elisp is straight forward except that a copy of the AST is
made when evaluating a ~defun~. This is important because the AST is
destructively modified when compiled to Elisp and Shen requires the original
source for introspecting, profiling and tracking.
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/eval-kl (X)
    (if (and (consp X) (eq (car X) 'defun))
        (progn
          (byte-compile (eval (shen/internal/kl-to-elisp (copy-tree X)) 't))
          (nth 1 X))
      (eval (shen/internal/kl-to-elisp X) 't)))
#+END_SRC
** Generate From Seed KLambda Files
Generating ~shen.el~, the file that contains the Elisp compiled from the
bootstrap KLambda files, requires a slightly different approach because we
override the default generated Elisp with custom implementations.
