melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline47" class="outline-3">
<h3 id="orgheadline47"><span class="section-number-3">5.6</span> Nil Comparisons To Null</h3>
<div class="outline-text-3" id="text-5-6">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/nil-to-null</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/internal/consolidate
   ast
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span>and current-list
          <span style="color: #907373;">(</span>consp current-list<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>eq <span style="color: #333333; font-weight: bold;">3</span> <span style="color: #6276ba;">(</span>length current-list<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>and <span style="color: #6276ba;">(</span>eq <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> current-list<span style="color: #858580;">)</span> 'shen/=<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span>or <span style="color: #858580;">(</span>eq <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #80a880;">)</span> 'nil<span style="color: #858580;">)</span>
                   <span style="color: #858580;">(</span>eq <span style="color: #80a880;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-list<span style="color: #80a880;">)</span> 'nil<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum current-list<span style="color: #709870;">)</span>
     <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #907373;">(</span>eq <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #6276ba;">)</span> 'nil<span style="color: #907373;">)</span>
         <span style="color: #907373;">(</span>list <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">2</span> current-list<span style="color: #6276ba;">)</span> nil<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>list <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> current-list<span style="color: #6276ba;">)</span> nil<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>accum remaining-chain<span style="color: #709870;">)</span>
     `<span style="color: #709870;">(</span>shen/predicate-&gt;shen <span style="color: #907373;">(</span>null ,accum<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline49" class="outline-2">
<h2 id="orgheadline49"><span class="section-number-2">6</span> Evaluate KLambda</h2>
<div class="outline-text-2" id="text-6">
<p>
Now that the mechanisms for <a href="#orgheadline34">applying functions</a>, and <a href="#orgheadline40">quoting/namespacing</a> are in place
converting KLambda to Elisp is just a couple of function calls.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/internal/kl-to-elisp</span> <span style="color: #7388d6;">(</span>Kl<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/internal/nil-to-null
   <span style="color: #909183;">(</span>shen/internal/add-1+
    <span style="color: #709870;">(</span>shen/internal/consolidate-tl
     <span style="color: #907373;">(</span>shen/internal/consolidate-@s
      <span style="color: #6276ba;">(</span>shen/internal/consolidate-cons <span style="color: #858580;">(</span>shen/internal/parse-ast Kl<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Evaluating KLambda to Elisp is straight forward except that a copy of the AST is
made when evaluating a <code>defun</code>. This is important because the AST is
destructively modified when compiled to Elisp and Shen requires the original
source for introspecting, profiling and tracking.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/eval-kl</span> <span style="color: #7388d6;">(</span>X<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>and <span style="color: #709870;">(</span>consp X<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>eq <span style="color: #907373;">(</span>car X<span style="color: #907373;">)</span> 'defun<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
        <span style="color: #709870;">(</span>byte-compile <span style="color: #907373;">(</span>eval <span style="color: #6276ba;">(</span>shen/internal/kl-to-elisp <span style="color: #858580;">(</span>copy-tree X<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> 't<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> X<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval <span style="color: #709870;">(</span>shen/internal/kl-to-elisp X<span style="color: #709870;">)</span> 't<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgheadline52" class="outline-3">
<h3 id="orgheadline52"><span class="section-number-3">6.1</span> Generate From Seed KLambda Files</h3>
<div class="outline-text-3" id="text-6-1">
<p>
Generating <code>shen.el</code>, the file that contains the Elisp compiled from the
bootstrap KLambda files, requires a slightly different approach because we
override the default generated Elisp with custom implementations.
</p>
</div>
