melpa/working/shen-elisp/shen-primitives.el

;; [[file:shen-elisp.org::*Nil%20Comparisons%20To%20Null][Nil\ Comparisons\ To\ Null:1]]
(defun shen/internal/nil-to-null (ast)
  (shen/internal/consolidate
   ast
   (lambda (current-list)
     (and current-list
          (consp current-list)
          (eq 3 (length current-list))
          (and (eq (nth 0 current-list) 'shen/=)
               (or (eq (nth 1 current-list) 'nil)
                   (eq (nth 2 current-list) 'nil)))))
   (lambda (accum current-list)
     (if (eq (nth 1 current-list) 'nil)
         (list (nth 2 current-list) nil)
       (list (nth 1 current-list) nil)))
   (lambda (accum remaining-chain)
     `(shen/predicate->shen (null ,accum)))))
;; Nil\ Comparisons\ To\ Null:1 ends here

;; [[file:shen-elisp.org::*Evaluate%20KLambda][Evaluate\ KLambda:1]]
(defun shen/internal/kl-to-elisp (Kl)
  (shen/internal/nil-to-null
   (shen/internal/add-1+
    (shen/internal/consolidate-tl
     (shen/internal/consolidate-@s
      (shen/internal/consolidate-cons (shen/internal/parse-ast Kl)))))))
;; Evaluate\ KLambda:1 ends here

;; [[file:shen-elisp.org::*Evaluate%20KLambda][Evaluate\ KLambda:2]]
(defun shen/eval-kl (X)
  (if (and (consp X) (eq (car X) 'defun))
      (progn
        (byte-compile (eval (shen/internal/kl-to-elisp (copy-tree X)) 't))
        (nth 1 X))
    (eval (shen/internal/kl-to-elisp X) 't)))
;; Evaluate\ KLambda:2 ends here
