melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline50" class="outline-4">
<h4 id="orgheadline50"><span class="section-number-4">6.1.1</span> Overrides</h4>
<div class="outline-text-4" id="text-6-1-1">
<p>
The following hash-table has the name of the function as the key and the new implementation
as the value. When Klambda code is read in when a matching function is detected the entire
form is <a href="#orgheadline49">replaced</a> with the new implementation.
</p>

<p>
There are three types of overrides, those which:
</p>
<ol class="org-ol">
<li>boost <a href="#coderef-performance"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-performance');" onmouseout="CodeHighlightOff(this, 'coderef-performance');">performance</a></li>
<li>are necessary because KLambda vectors are represented as <a href="#coderef-hash-tables"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-hash-tables');" onmouseout="CodeHighlightOff(this, 'coderef-hash-tables');">hash-tables</a>.</li>
<li>are necessary because Klambda functions are <a href="#coderef-namespacing"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-namespacing');" onmouseout="CodeHighlightOff(this, 'coderef-namespacing');">prefixed</a>.</li>
<li>fix <a href="#coderef-klambda bugs"class="coderef" onmouseover="CodeHighlightOn(this, 'coderef-klambda bugs');" onmouseout="CodeHighlightOff(this, 'coderef-klambda bugs');">klambda bugs</a>.</li>
</ol>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>setq shen/*overrides*
      <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>table <span style="color: #907373;">(</span>make-hash-table <span style="color: #333333; font-weight: bold;">:test</span> 'equal<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
<span id="coderef-performance" class="coderef-off">        <span style="color: #d9d9d9;">;;</span> (performance)</span>
        <span style="color: #909183;">(</span>puthash 'map
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/map</span> <span style="color: #907373;">(</span>F Xs<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span>mapcar <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #858580;">(</span>X<span style="color: #858580;">)</span>
                              <span style="color: #858580;">(</span>shen/internal/apply-higher-order-function F <span style="color: #80a880;">(</span>list X<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                            Xs<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'shen.lazyderef
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen</span>\.lazyderef
                      <span style="color: #907373;">(</span>X ProcessN<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>Current X<span style="color: #858580;">)</span>
                          <span style="color: #858580;">(</span>KeepLooking 't<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">while</span> KeepLooking
                        <span style="color: #858580;">(</span>shen/if
                         <span style="color: #80a880;">(</span>shen/shen.pvar? Current<span style="color: #80a880;">)</span>
                         <span style="color: #80a880;">(</span>shen/let Value <span style="color: #887070;">(</span>shen/shen.valvector Current ProcessN<span style="color: #887070;">)</span>
                                   <span style="color: #887070;">(</span>shen/if <span style="color: #707183;">(</span>shen/= Value 'shen.-null-<span style="color: #707183;">)</span>
                                            <span style="color: #707183;">(</span>setq KeepLooking nil<span style="color: #707183;">)</span>
                                            <span style="color: #707183;">(</span>setq Current Value<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                         <span style="color: #80a880;">(</span>setq KeepLooking nil<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      Current<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'append
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/append</span> <span style="color: #907373;">(</span>Xs Ys<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>append Xs Ys<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'shen.string-&gt;bytes
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.string-&gt;bytes</span> <span style="color: #907373;">(</span>S<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span>string-to-list S<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'shen.sum
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.sum</span> <span style="color: #907373;">(</span>Xs<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>apply #'+ Xs<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'shen.mod
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.mod</span> <span style="color: #907373;">(</span>N Div<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>mod N Div<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'integer?
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/integer?</span> <span style="color: #907373;">(</span>N<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>integerp N<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'abs
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.abs</span> <span style="color: #907373;">(</span>N<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>abs N<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'nth
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/nth</span> <span style="color: #907373;">(</span>I Xs<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>nth I Xs<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
<span id="coderef-hash-tables" class="coderef-off">         <span style="color: #d9d9d9;">;;</span> (hash-tables)</span>
        <span style="color: #909183;">(</span>puthash 'shen/hash
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/hash</span>
                      <span style="color: #907373;">(</span>String Limit<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>Hash <span style="color: #80a880;">(</span>shen/mod <span style="color: #887070;">(</span>shen/sum <span style="color: #707183;">(</span>shen/shen.string-&gt;bytes String<span style="color: #707183;">)</span><span style="color: #887070;">)</span> Limit<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>= <span style="color: #333333; font-weight: bold;">0</span> Hash<span style="color: #858580;">)</span> <span style="color: #333333; font-weight: bold;">1</span> Hash<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash '<span style="color: #709870;">(</span>set *property-vector* <span style="color: #907373;">(</span>vector <span style="color: #333333; font-weight: bold;">20000</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 `<span style="color: #709870;">(</span>shen/set '*property-vector* <span style="color: #907373;">(</span>make-hash-table <span style="color: #333333; font-weight: bold;">:size</span> <span style="color: #333333; font-weight: bold;">1000</span> <span style="color: #333333; font-weight: bold;">:test</span> <span style="color: #6276ba;">(</span>quote equal<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'get
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/get</span>
                      <span style="color: #907373;">(</span>Pointer Key Table<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>Subtable <span style="color: #80a880;">(</span>gethash Pointer Table<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>not Subtable<span style="color: #858580;">)</span>
                          <span style="color: #858580;">(</span>shen/simple-error
                           <span style="color: #80a880;">(</span>format <span style="color: #666666;">"pointer not found: %s\n"</span> Pointer<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>Value <span style="color: #707183;">(</span>gethash Key Subtable<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                          <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #887070;">(</span>not Value<span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>shen/simple-error
                               <span style="color: #707183;">(</span>format <span style="color: #666666;">"value not found: %s\n"</span> <span style="color: #7388d6;">(</span>list Pointer Key<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                          Value<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'put
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/put</span>
                      <span style="color: #907373;">(</span>Pointer Key Value Table<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>Subtable <span style="color: #80a880;">(</span>gethash Pointer Table<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>not Subtable<span style="color: #858580;">)</span>
                          <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>Subtable <span style="color: #707183;">(</span>make-hash-table <span style="color: #333333; font-weight: bold;">:test</span> 'equal<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                              <span style="color: #887070;">(</span>puthash Pointer Subtable Table<span style="color: #887070;">)</span>
                              <span style="color: #887070;">(</span>puthash Key Value Subtable<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>puthash Key Value Subtable<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'unput
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/unput</span>
                      <span style="color: #907373;">(</span>Pointer Key Table<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>Subtable <span style="color: #80a880;">(</span>gethash Pointer Table<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span>and Subtable
                           <span style="color: #858580;">(</span>remhash Key Subtable<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      Pointer<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>puthash 'shen.resize-vector
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.resize-vector</span> <span style="color: #907373;">(</span>Vector NewSize Fill<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>VectorLimit <span style="color: #80a880;">(</span>shen/&lt;-address Vector <span style="color: #333333; font-weight: bold;">0</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                           <span style="color: #858580;">(</span>Current-Index <span style="color: #80a880;">(</span>1+ VectorLimit<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span>puthash <span style="color: #333333; font-weight: bold;">0</span> NewSize Vector<span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #858580;">(</span>&lt;= Current-Index NewSize<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>puthash Current-Index Fill Vector<span style="color: #858580;">)</span>
                        <span style="color: #858580;">(</span>setq Current-Index <span style="color: #80a880;">(</span>1+ Current-Index<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      Vector<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
<span id="coderef-namespacing" class="coderef-off">        <span style="color: #d9d9d9;">;;</span> (namespacing)</span>
        <span style="color: #909183;">(</span>puthash 'function
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/function</span> <span style="color: #907373;">(</span>S<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span>shen/shen\.lookup-func
                     <span style="color: #6276ba;">(</span>shen/internal/unprefix-symbol S<span style="color: #6276ba;">)</span>
                     <span style="color: #6276ba;">(</span>shen/value 'shen\.*symbol-table*<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
<span id="coderef-klambda bugs" class="coderef-off">        <span style="color: #d9d9d9;">;;</span> (klambda bugs)</span>
        <span style="color: #909183;">(</span>puthash 'untrack
                 `<span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/untrack</span> <span style="color: #907373;">(</span>F<span style="color: #907373;">)</span>
                    <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                      <span style="color: #6276ba;">(</span>shen/set 'shen.*tracking* <span style="color: #858580;">(</span>shen/internal/delete-first-eq F <span style="color: #80a880;">(</span>shen/value 'shen.*tracking*<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
                      <span style="color: #6276ba;">(</span>shen/eval <span style="color: #858580;">(</span>shen/ps F<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
                 table<span style="color: #909183;">)</span>
        table<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
