melpa/working/shen-elisp/shen-elisp.org
*** Evaluating Bootstrapped KLambda
When bootstrapping from the seed KLambda files we first need to [[Overrides][patch]] the
incoming code with overrides before parsing the AST:
#+BEGIN_SRC elisp "(ref:%s)" :tangle shen-primitives.el
   (defun shen/patch-klambda (ast)
    (if (eq (car ast) 'defun)
          (let ((override (gethash (nth 1 ast) shen/*overrides*)))
            (or override
                (shen/internal/parse-ast ast)))
        (let ((patched (gethash ast shen/*overrides* )))
          (or patched
              (shen/internal/parse-ast ast)))))
#+END_SRC

#+BEGIN_SRC elisp :tangle shen-primitives.el
  (defun shen/kl-to-buffer (X B)
    (with-current-buffer B
      (save-excursion
        (goto-char (point-max))
        (insert (pp-to-string
                 (shen/internal/nil-to-null
                  (shen/internal/add-1+
                   (shen/internal/consolidate-tl
                    (shen/internal/consolidate-@s
                     (shen/internal/consolidate-cons
                      (shen/patch-klambda X)))))))))))
#+END_SRC

* Providing The Primitives
#+BEGIN_SRC elisp :tangle shen-primitives.el
  (provide 'shen-primitives)
#+END_SRC
* Overlays
Override of some of Shen's default implementations.
** Symbol Table
The Shen runtime maintains a ~*symbol-table* which is a mapping of all generated and
native functions to their partially applied lambda form.

The bootstrapped KLambda code uses simple alists which are inefficient and since
this structure has to be consulted thousands of times (especially while
typechecking), the KLambda provided implemenatation really slows everything
down so we need to migrate to a hash-table.

Additionally the bootstrap KLambda files actually fills up this structure with
some initial content for core functions and datatypes so they need to be migrated:
#+BEGIN_SRC elisp :tangle shen-overlays.el
  (defun shen/migrate-symbol-table ()
    (let ((SymbolTable (shen/value 'shen.*symbol-table*)))
      (if (not (hash-table-p SymbolTable))
          (let ((NewTable (make-hash-table)))
            (dolist (Entry SymbolTable NewTable)
              (puthash (car Entry) (cdr Entry) NewTable))
            (shen/set 'shen.*symbol-table* NewTable))
        SymbolTable)))
#+END_SRC

And then the routines that find and add entries to the symbol table need to be
re-implemented:
#+BEGIN_SRC elisp :tangle shen-overlays.el
  (defun shen/shen.lookup-func
      (Name Table)
    (let ((Form (gethash Name Table)))
      (if (not Form)
          (shen/simple-error
           (shen/app Name " has no lambda expansion\n" 'shen.a))
        Form)))

  (defun shen/shen.update-symbol-table
      (Name Arity)
    (let ((lambda-function
           (shen/eval-kl
            (shen/shen.lambda-form Name Arity))))
      (puthash Name lambda-function (shen/value 'shen.*symbol-table*))
      (shen/value 'shen.*symbol-table*)))
#+END_SRC
** Repl
