melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline51" class="outline-4">
<h4 id="orgheadline51"><span class="section-number-4">6.1.2</span> Evaluating Bootstrapped KLambda</h4>
<div class="outline-text-4" id="text-6-1-2">
<p>
When bootstrapping from the seed KLambda files we first need to <a href="#orgheadline50">patch</a> the
incoming code with overrides before parsing the AST:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/patch-klambda</span> <span style="color: #7388d6;">(</span>ast<span style="color: #7388d6;">)</span>
 <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>eq <span style="color: #709870;">(</span>car ast<span style="color: #709870;">)</span> 'defun<span style="color: #909183;">)</span>
       <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>override <span style="color: #6276ba;">(</span>gethash <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> ast<span style="color: #858580;">)</span> shen/*overrides*<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>or override
             <span style="color: #907373;">(</span>shen/internal/parse-ast ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
     <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>patched <span style="color: #6276ba;">(</span>gethash ast shen/*overrides* <span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
       <span style="color: #709870;">(</span>or patched
           <span style="color: #907373;">(</span>shen/internal/parse-ast ast<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/kl-to-buffer</span> <span style="color: #7388d6;">(</span>X B<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span> B
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">save-excursion</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>pp-to-string
               <span style="color: #6276ba;">(</span>shen/internal/nil-to-null
                <span style="color: #858580;">(</span>shen/internal/add-1+
                 <span style="color: #80a880;">(</span>shen/internal/consolidate-tl
                  <span style="color: #887070;">(</span>shen/internal/consolidate-@s
                   <span style="color: #707183;">(</span>shen/internal/consolidate-cons
                    <span style="color: #7388d6;">(</span>shen/patch-klambda X<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgheadline53" class="outline-2">
<h2 id="orgheadline53"><span class="section-number-2">7</span> Providing The Primitives</h2>
<div class="outline-text-2" id="text-7">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">provide</span> '<span style="color: #333333; font-weight: bold;">shen-primitives</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline59" class="outline-2">
<h2 id="orgheadline59"><span class="section-number-2">8</span> Overlays</h2>
<div class="outline-text-2" id="text-8">
<p>
Override of some of Shen's default implementations.
</p>
</div>
<div id="outline-container-orgheadline54" class="outline-3">
<h3 id="orgheadline54"><span class="section-number-3">8.1</span> Symbol Table</h3>
<div class="outline-text-3" id="text-8-1">
<p>
The Shen runtime maintains a ~*symbol-table* which is a mapping of all generated and
native functions to their partially applied lambda form.
</p>

<p>
The bootstrapped KLambda code uses simple alists which are inefficient and since
this structure has to be consulted thousands of times (especially while
typechecking), the KLambda provided implemenatation really slows everything
down so we need to migrate to a hash-table.
</p>

<p>
Additionally the bootstrap KLambda files actually fills up this structure with
some initial content for core functions and datatypes so they need to be migrated:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/migrate-symbol-table</span> <span style="color: #7388d6;">()</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>SymbolTable <span style="color: #907373;">(</span>shen/value 'shen.*symbol-table*<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>not <span style="color: #907373;">(</span>hash-table-p SymbolTable<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>NewTable <span style="color: #858580;">(</span>make-hash-table<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #6276ba;">(</span>Entry SymbolTable NewTable<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>puthash <span style="color: #858580;">(</span>car Entry<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>cdr Entry<span style="color: #858580;">)</span> NewTable<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>shen/set 'shen.*symbol-table* NewTable<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      SymbolTable<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
And then the routines that find and add entries to the symbol table need to be
re-implemented:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.lookup-func</span>
    <span style="color: #7388d6;">(</span>Name Table<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>Form <span style="color: #907373;">(</span>gethash Name Table<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>not Form<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>shen/simple-error
         <span style="color: #907373;">(</span>shen/app Name <span style="color: #666666;">" has no lambda expansion\n"</span> 'shen.a<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      Form<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.update-symbol-table</span>
    <span style="color: #7388d6;">(</span>Name Arity<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>lambda-function
         <span style="color: #907373;">(</span>shen/eval-kl
          <span style="color: #6276ba;">(</span>shen/shen.lambda-form Name Arity<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>puthash Name lambda-function <span style="color: #709870;">(</span>shen/value 'shen.*symbol-table*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/value 'shen.*symbol-table*<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
