melpa/working/shen-elisp/shen-elisp.org
*** Questions
Overlay the routines that take input from the user in the REPL session to use the mini-buffer
#+BEGIN_SRC elisp :tangle shen-overlays.el
  (defun shen/y-or-n? (S)
    (progn
      (shen/shen.prhush (shen/shen.proc-nl S) (shen/stoutput))
      (let ((Input (format "%s" (read-from-minibuffer " (y/n) " ))))
        (cond
         ((string-equal Input "y") 'true)
         ((string-equal Input "n") 'false)
         (t (progn
              (shen/shen.prhush  "please answer y or n~%" (shen/stoutput))
              (shen/y-or-n? S)))))))

  (defun shen/shen.pause-for-user nil
    (let ((Byte (read-from-minibuffer "")))
      (if (and (= 1 (length Byte)) (= (string-to-char Byte) ?^))
          (shen/simple-error "input aborted\n")
        (shen/nl 1))))
#+END_SRC
*** Changing Directories
When changing directories in the REPL, for convenience, also change Emacs' working directory.
#+BEGIN_SRC elisp :tangle shen-overlays.el
  (defun shen/cd (Path)
    (if (shen/shen->predicate (shen/= Path ""))
        (shen/set '*home-directory* "")
      (let ((PathString (concat Path "/")))
        (progn
          (setq default-directory PathString)
          (shen/set '*home-directory* PathString))
        PathString)))
#+END_SRC
** Provide it
#+BEGIN_SRC elisp :tangle shen-overlays.el
  (provide 'shen-overlays)
#+END_SRC
* Shen REPL
#+BEGIN_SRC elisp :tangle shen-repl.el :comments no
  ;; -*- lexical-binding: t -*-
#+END_SRC

#+BEGIN_SRC elisp :tangle shen-repl.el
  (require 'comint)
  (require 'shen-primitives)
  (require 'shen)
  (require 'shen-overlays)
#+END_SRC
** Credits
The credits that appear at the top of each REPL session.
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defconst shen/shen.credits
    (format "%s\n%s\n%s\n%s\n\n"
            "Shen, copyright (C) 2010-2015 Mark Tarver"
            (format "www.shenlanguage.org, %s" (shen/value '*version*))
            (format "running under %s, implementation: %s" (shen/value '*language*) (shen/value '*implementation*))
            (format "port %s ported by %s" (shen/value '*port*) (shen/value '*porters*))))
#+END_SRC

