melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline57" class="outline-3">
<h3 id="orgheadline57"><span class="section-number-3">8.2</span> Repl</h3>
<div class="outline-text-3" id="text-8-2">
</div><div id="outline-container-orgheadline55" class="outline-4">
<h4 id="orgheadline55"><span class="section-number-4">8.2.1</span> Questions</h4>
<div class="outline-text-4" id="text-8-2-1">
<p>
Overlay the routines that take input from the user in the REPL session to use the mini-buffer
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/y-or-n?</span> <span style="color: #7388d6;">(</span>S<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
    <span style="color: #909183;">(</span>shen/shen.prhush <span style="color: #709870;">(</span>shen/shen.proc-nl S<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>shen/stoutput<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>Input <span style="color: #6276ba;">(</span>format <span style="color: #666666;">"%s"</span> <span style="color: #858580;">(</span>read-from-minibuffer <span style="color: #666666;">" (y/n) "</span> <span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
       <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>string-equal Input <span style="color: #666666;">"y"</span><span style="color: #6276ba;">)</span> 'true<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>string-equal Input <span style="color: #666666;">"n"</span><span style="color: #6276ba;">)</span> 'false<span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>t <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
            <span style="color: #858580;">(</span>shen/shen.prhush  <span style="color: #666666;">"please answer y or n~%"</span> <span style="color: #80a880;">(</span>shen/stoutput<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
            <span style="color: #858580;">(</span>shen/y-or-n? S<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/shen.pause-for-user</span> nil
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>Byte <span style="color: #907373;">(</span>read-from-minibuffer <span style="color: #666666;">""</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>and <span style="color: #907373;">(</span>= <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #6276ba;">(</span>length Byte<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span> <span style="color: #907373;">(</span>= <span style="color: #6276ba;">(</span>string-to-char Byte<span style="color: #6276ba;">)</span> ?^<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>shen/simple-error <span style="color: #666666;">"input aborted\n"</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>shen/nl <span style="color: #333333; font-weight: bold;">1</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline56" class="outline-4">
<h4 id="orgheadline56"><span class="section-number-4">8.2.2</span> Changing Directories</h4>
<div class="outline-text-4" id="text-8-2-2">
<p>
When changing directories in the REPL, for convenience, also change Emacs' working directory.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/cd</span> <span style="color: #7388d6;">(</span>Path<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #909183;">(</span>shen/shen-&gt;predicate <span style="color: #709870;">(</span>shen/= Path <span style="color: #666666;">""</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>shen/set '*home-directory* <span style="color: #666666;">""</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>PathString <span style="color: #6276ba;">(</span>concat Path <span style="color: #666666;">"/"</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
        <span style="color: #907373;">(</span>setq default-directory PathString<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set '*home-directory* PathString<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      PathString<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline58" class="outline-3">
<h3 id="orgheadline58"><span class="section-number-3">8.3</span> Provide it</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">provide</span> '<span style="color: #333333; font-weight: bold;">shen-overlays</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline20" class="outline-2">
<h2 id="orgheadline20"><span class="section-number-2">9</span> Shen REPL</h2>
<div class="outline-text-2" id="text-9">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">-*- lexical-binding: t -*-</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">require</span> '<span style="color: #333333; font-weight: bold;">comint</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">require</span> '<span style="color: #333333; font-weight: bold;">shen-primitives</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">require</span> '<span style="color: #333333; font-weight: bold;">shen</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">require</span> '<span style="color: #333333; font-weight: bold;">shen-overlays</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
<div id="outline-container-orgheadline60" class="outline-3">
<h3 id="orgheadline60"><span class="section-number-3">9.1</span> Credits</h3>
<div class="outline-text-3" id="text-9-1">
<p>
The credits that appear at the top of each REPL session.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/shen.credits</span>
  <span style="color: #7388d6;">(</span>format <span style="color: #666666;">"%s\n%s\n%s\n%s\n\n"</span>
          <span style="color: #666666;">"Shen, copyright (C) 2010-2015 Mark Tarver"</span>
          <span style="color: #909183;">(</span>format <span style="color: #666666;">"www.shenlanguage.org, %s"</span> <span style="color: #709870;">(</span>shen/value '*version*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>format <span style="color: #666666;">"running under %s, implementation: %s"</span> <span style="color: #709870;">(</span>shen/value '*language*<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>shen/value '*implementation*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span>format <span style="color: #666666;">"port %s ported by %s"</span> <span style="color: #709870;">(</span>shen/value '*port*<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>shen/value '*porters*<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
