melpa/working/shen-elisp/shen-repl.el
;; -*- lexical-binding: t -*-

;; [[file:shen-elisp.org::*Shen%20REPL][Shen\ REPL:2]]
(require 'comint)
(require 'shen-primitives)
(require 'shen)
(require 'shen-overlays)
;; Shen\ REPL:2 ends here

;; [[file:shen-elisp.org::*Credits][Credits:1]]
(defconst shen/shen.credits
  (format "%s\n%s\n%s\n%s\n\n"
          "Shen, copyright (C) 2010-2015 Mark Tarver"
          (format "www.shenlanguage.org, %s" (shen/value '*version*))
          (format "running under %s, implementation: %s" (shen/value '*language*) (shen/value '*implementation*))
          (format "port %s ported by %s" (shen/value '*port*) (shen/value '*porters*))))
;; Credits:1 ends here

;; [[file:shen-elisp.org::*Prompt][Prompt:1]]
(defconst shen/repl-prompt-regex
  (rx line-start
      (char ?( )
            (1+ digit)
            (or (char ?-) (char ?+))
            (char ?))
      (char ? )))
;; Prompt:1 ends here
