melpa/working/shen-elisp/shen-elisp.org
** Prompt
The Shen REPL prompt looks like ~(0-)~ and ~(100+)~ where the number is a
counter of the number of REPL interactions so far and the ~-~ and ~+~ indicate
whether typechecking is currently enabled.

First we tell the REPL how to recognize prompts:
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defconst shen/repl-prompt-regex
    (rx line-start
        (char ?( )
              (1+ digit)
              (or (char ?-) (char ?+))
              (char ?))
        (char ? )))
#+END_SRC

and make them:
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defun shen/make-prompt nil
    (format "(%d%s) "
            (shen/length (shen/value 'shen.*history*))
            (if (shen/shen->predicate (shen/value 'shen.*tc*))
                "+"
              "-")))
#+END_SRC

** Input Events
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defvar shen/repl-map
    (let ((map (make-sparse-keymap)))
      (define-key map "\C-j" 'shen/repl-send-input)
      (define-key map "\C-m" 'shen/repl-return)
      map))

  (defvaralias 'shen/repl-mode-map 'shen/repl-map)

  (defun shen/repl-return nil
    (interactive)
    (shen/repl-send-input))

  (defvar shen/repl-input)

  (defun shen/repl-send-input nil
    (interactive)
    (progn
      (comint-send-input)
      (condition-case ex
          (progn
            (shen/shen.initialise_environment)
            (shen/repl-eval (string-to-list shen/repl-input)))
        ('error
         (comint-output-filter (shen/repl-process) (format "%s\n%s" ex  (shen/make-prompt)))
         (signal (car ex) (cdr ex))))
      (with-current-buffer *shen-repl*
        (goto-char (point-max)))))
#+END_SRC

