melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline61" class="outline-3">
<h3 id="orgheadline61"><span class="section-number-3">9.2</span> Prompt</h3>
<div class="outline-text-3" id="text-9-2">
<p>
The Shen REPL prompt looks like <code>(0-)</code> and <code>(100+)</code> where the number is a
counter of the number of REPL interactions so far and the <code>-</code> and <code>+</code> indicate
whether typechecking is currently enabled.
</p>

<p>
First we tell the REPL how to recognize prompts:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/repl-prompt-regex</span>
  <span style="color: #7388d6;">(</span>rx line-start
      <span style="color: #909183;">(</span>char ?<span style="color: #709870;">(</span> <span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>1+ digit<span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>or <span style="color: #907373;">(</span>char ?-<span style="color: #907373;">)</span> <span style="color: #907373;">(</span>char ?+<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
            <span style="color: #709870;">(</span>char ?<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
      <span style="color: #909183;">(</span>char ? <span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
and make them:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/make-prompt</span> nil
  <span style="color: #7388d6;">(</span>format <span style="color: #666666;">"(%d%s) "</span>
          <span style="color: #909183;">(</span>shen/length <span style="color: #709870;">(</span>shen/value 'shen.*history*<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
          <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #709870;">(</span>shen/shen-&gt;predicate <span style="color: #907373;">(</span>shen/value 'shen.*tc*<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
              <span style="color: #666666;">"+"</span>
            <span style="color: #666666;">"-"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgheadline62" class="outline-3">
<h3 id="orgheadline62"><span class="section-number-3">9.3</span> Input Events</h3>
<div class="outline-text-3" id="text-9-3">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defvar</span> <span style="color: #333333;">shen/repl-map</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>map <span style="color: #907373;">(</span>make-sparse-keymap<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-key map <span style="color: #666666;">"\C-j"</span> 'shen/repl-send-input<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>define-key map <span style="color: #666666;">"\C-m"</span> 'shen/repl-return<span style="color: #909183;">)</span>
    map<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defvaralias</span> '<span style="color: #333333;">shen/repl-mode-map</span> 'shen/repl-map<span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-return</span> nil
  <span style="color: #7388d6;">(</span>interactive<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>shen/repl-send-input<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defvar</span> <span style="color: #333333;">shen/repl-input</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-send-input</span> nil
  <span style="color: #7388d6;">(</span>interactive<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
    <span style="color: #909183;">(</span>comint-send-input<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex
        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
          <span style="color: #907373;">(</span>shen/shen.initialise_environment<span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>shen/repl-eval <span style="color: #6276ba;">(</span>string-to-list shen/repl-input<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>'error
       <span style="color: #907373;">(</span>comint-output-filter <span style="color: #6276ba;">(</span>shen/repl-process<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>format <span style="color: #666666;">"%s\n%s"</span> ex  <span style="color: #858580;">(</span>shen/make-prompt<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> <span style="color: #6276ba;">(</span>car ex<span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>cdr ex<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span> *shen-repl*
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
