melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline63" class="outline-3">
<h3 id="orgheadline63"><span class="section-number-3">9.4</span> Evaluating User Input</h3>
<div class="outline-text-3" id="text-9-4">
<p>
The following is a cut-and-paste of <code>ielm-standard-output-impl</code> which apparently
does not exist in older versions of Emacs (a user reported a bug on 24.4.1).
</p>

<p>
It periodically writes to the REPL.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-standard-output-impl</span> <span style="color: #7388d6;">(</span>process<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>output-buffer nil<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>flush-timer nil<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>flush-buffer
          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #6276ba;">()</span>
            <span style="color: #6276ba;">(</span>comint-output-filter
             process
             <span style="color: #858580;">(</span>apply #'string <span style="color: #80a880;">(</span>nreverse output-buffer<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>redisplay<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>setf output-buffer nil<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">when</span> flush-timer
              <span style="color: #858580;">(</span>cancel-timer flush-timer<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span>setf flush-timer nil<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>char<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span>flush-now<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">cond</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>and <span style="color: #80a880;">(</span>eq char t<span style="color: #80a880;">)</span> output-buffer<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>push ?\n output-buffer<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>setf flush-now t<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
              <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>characterp char<span style="color: #858580;">)</span>
               <span style="color: #858580;">(</span>push char output-buffer<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">if</span> flush-now
            <span style="color: #6276ba;">(</span>funcall flush-buffer<span style="color: #6276ba;">)</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">unless</span> flush-timer
            <span style="color: #858580;">(</span>setf flush-timer <span style="color: #80a880;">(</span>run-with-timer <span style="color: #333333; font-weight: bold;">0.1</span> nil flush-buffer<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-process</span> nil
  <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">Return the current buffer's process.</span>
  <span style="color: #7388d6;">(</span>get-buffer-process <span style="color: #909183;">(</span>current-buffer<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-eval</span> <span style="color: #7388d6;">(</span>input-string<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>active-process <span style="color: #907373;">(</span>shen/repl-process<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>shen/repl-temp-buffer<span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>clean-up <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #6276ba;">(</span>active-process <span style="color: #333333; font-style: italic;">&amp;optional</span> ex<span style="color: #6276ba;">)</span>
                     <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                       <span style="color: #858580;">(</span>comint-output-filter active-process
                                             <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">if</span> ex
                                                 <span style="color: #887070;">(</span>format <span style="color: #666666;">"\n%s\n\n%s"</span> <span style="color: #707183;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> ex<span style="color: #707183;">)</span> <span style="color: #707183;">(</span>shen/make-prompt<span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                                               <span style="color: #887070;">(</span>format <span style="color: #666666;">"\n%s"</span> <span style="color: #707183;">(</span>shen/make-prompt<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>funcall <span style="color: #80a880;">(</span>shen/value '*stoutput*<span style="color: #80a880;">)</span> t<span style="color: #858580;">)</span>
                       <span style="color: #858580;">(</span>shen/set '*stoutput* standard-output<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> ex
        <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
          <span style="color: #907373;">(</span>shen/set '*stoutput* <span style="color: #6276ba;">(</span>shen/repl-standard-output-impl active-process<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span>set-buffer <span style="color: #6276ba;">(</span>get-buffer *shen-repl*<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>Lineread
                  <span style="color: #80a880;">(</span>shen/compile #'shen/shen.&lt;st_input&gt; input-string
                                <span style="color: #887070;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #707183;">(</span>Err<span style="color: #707183;">)</span> <span style="color: #707183;">(</span><span style="color: #ff0000; font-weight: bold;">signal</span> <span style="color: #7388d6;">(</span>car Err<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>cdr Err<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>It <span style="color: #80a880;">(</span>shen/shen.record-it input-string<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>History <span style="color: #80a880;">(</span>shen/value 'shen.*history*<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>NewLineread <span style="color: #80a880;">(</span>shen/shen.retrieve-from-history-if-needed
                               <span style="color: #887070;">(</span>shen/@p Lineread input-string<span style="color: #887070;">)</span>
                               History<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>NewHistory <span style="color: #80a880;">(</span>shen/shen.update_history NewLineread History<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>Parsed <span style="color: #80a880;">(</span>shen/fst NewLineread<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">if</span> <span style="color: #858580;">(</span>not Parsed<span style="color: #858580;">)</span>
                <span style="color: #858580;">(</span>funcall clean-up active-process<span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                <span style="color: #80a880;">(</span>shen/shen.toplevel Parsed<span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>funcall <span style="color: #887070;">(</span>shen/value '*stoutput*<span style="color: #887070;">)</span> t<span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>comint-output-filter active-process <span style="color: #887070;">(</span>format <span style="color: #666666;">"\n%s"</span> <span style="color: #707183;">(</span>shen/make-prompt<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>'shen/error <span style="color: #907373;">(</span>funcall clean-up active-process ex<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
