melpa/working/shen-elisp/shen-repl.el

;; [[file:shen-elisp.org::*Evaluating%20User%20Input][Evaluating\ User\ Input:1]]
(defun shen/repl-standard-output-impl (process)
  (let* ((output-buffer nil)
         (flush-timer nil)
         (flush-buffer
          (lambda ()
            (comint-output-filter
             process
             (apply #'string (nreverse output-buffer)))
            (redisplay)
            (setf output-buffer nil)
            (when flush-timer
              (cancel-timer flush-timer)
              (setf flush-timer nil)))))
    (lambda (char)
      (let (flush-now)
        (cond ((and (eq char t) output-buffer)
               (push ?\n output-buffer)
               (setf flush-now t))
              ((characterp char)
               (push char output-buffer)))
        (if flush-now
            (funcall flush-buffer)
          (unless flush-timer
            (setf flush-timer (run-with-timer 0.1 nil flush-buffer))))))))
;; Evaluating\ User\ Input:1 ends here

;; [[file:shen-elisp.org::*Evaluating%20User%20Input][Evaluating\ User\ Input:2]]
(defun shen/repl-process nil
  ;; Return the current buffer's process.
  (get-buffer-process (current-buffer)))

(defun shen/repl-eval (input-string)
  (let* ((active-process (shen/repl-process))
         (shen/repl-temp-buffer)
         (clean-up (lambda (active-process &optional ex)
                     (progn
                       (comint-output-filter active-process
                                             (if ex
                                                 (format "\n%s\n\n%s" (nth 1 ex) (shen/make-prompt))
                                               (format "\n%s" (shen/make-prompt))))
                       (funcall (shen/value '*stoutput*) t)
                       (shen/set '*stoutput* standard-output)))))
    (condition-case ex
        (progn
          (shen/set '*stoutput* (shen/repl-standard-output-impl active-process))
          (set-buffer (get-buffer *shen-repl*))
          (let* ((Lineread
                  (shen/compile #'shen/shen.<st_input> input-string
                                (lambda (Err) (signal (car Err) (cdr Err)))))
                 (It (shen/shen.record-it input-string))
                 (History (shen/value 'shen.*history*))
                 (NewLineread (shen/shen.retrieve-from-history-if-needed
                               (shen/@p Lineread input-string)
                               History))
                 (NewHistory (shen/shen.update_history NewLineread History))
                 (Parsed (shen/fst NewLineread)))
            (if (not Parsed)
                (funcall clean-up active-process)
              (progn
                (shen/shen.toplevel Parsed)
                (funcall (shen/value '*stoutput*) t)
                (comint-output-filter active-process (format "\n%s" (shen/make-prompt)))))))
      ('shen/error (funcall clean-up active-process ex)))))
;; Evaluating\ User\ Input:2 ends here
