melpa/working/shen-elisp/shen-elisp.org
** The REPL Mode
#+BEGIN_SRC elisp :tangle shen-repl.el
  (defconst shen/syntax-table
    (let ((table (make-syntax-table lisp-mode-syntax-table)))
      (modify-syntax-entry 59 "_") ;; semi-colon
      (modify-syntax-entry ?, "_")
      (modify-syntax-entry ?# "_")
      (modify-syntax-entry ?' "_")
      (modify-syntax-entry ?` "_")
      table))

  (defun shen/repl-input-sender (_proc input)
    (setq shen/repl-input input))

  (defun shen/repl-pm nil
    ;; Return the process mark of the current buffer.
    (process-mark (get-buffer-process (current-buffer))))

  (defun shen/repl-set-pm (pos)
    ;; Set the process mark in the current buffer to POS.
    (set-marker (process-mark (get-buffer-process (current-buffer))) pos))

  (define-derived-mode shen/repl-mode comint-mode "shen-repl-mode"
    :syntax-table shen/syntax-table
    (setq comint-prompt-regexp shen/repl-prompt-regex)
    (setq comint-use-prompt-regexp t)
    (setq comint-prompt-read-only t)
    (setq comint-input-sender 'shen/repl-input-sender)
    (setq-local comment-use-syntax 'undecided)
    (unless (comint-check-proc (current-buffer))
      (condition-case nil
          (start-process "shen/repl" (current-buffer) "cat")
        (file-error (start-process "shen/repl" (current-buffer) "hexl")))
      (set-process-query-on-exit-flag (shen/repl-process) nil)
      (goto-char (point-max))
      (set (make-local-variable 'comint-inhibit-carriage-motion) t)
      (insert shen/shen.credits)
      (shen/repl-set-pm (point-max))
      (comint-output-filter (shen/repl-process) "(0-) ")
      (set-marker comint-last-input-start (shen/repl-pm))
      (set-process-filter (get-buffer-process (current-buffer)) 'comint-output-filter)))

  (defconst *shen-repl* "*shen-repl*")
#+END_SRC
