melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline64" class="outline-3">
<h3 id="orgheadline64"><span class="section-number-3">9.5</span> The REPL Mode</h3>
<div class="outline-text-3" id="text-9-5">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">shen/syntax-table</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>table <span style="color: #907373;">(</span>make-syntax-table lisp-mode-syntax-table<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry <span style="color: #333333; font-weight: bold;">59</span> <span style="color: #666666;">"_"</span><span style="color: #909183;">)</span> <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">semi-colon</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?, <span style="color: #666666;">"_"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?# <span style="color: #666666;">"_"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?' <span style="color: #666666;">"_"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>modify-syntax-entry ?` <span style="color: #666666;">"_"</span><span style="color: #909183;">)</span>
    table<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-input-sender</span> <span style="color: #7388d6;">(</span>_proc input<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>setq shen/repl-input input<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-pm</span> nil
  <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">Return the process mark of the current buffer.</span>
  <span style="color: #7388d6;">(</span>process-mark <span style="color: #909183;">(</span>get-buffer-process <span style="color: #709870;">(</span>current-buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl-set-pm</span> <span style="color: #7388d6;">(</span>pos<span style="color: #7388d6;">)</span>
  <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">Set the process mark in the current buffer to POS.</span>
  <span style="color: #7388d6;">(</span>set-marker <span style="color: #909183;">(</span>process-mark <span style="color: #709870;">(</span>get-buffer-process <span style="color: #907373;">(</span>current-buffer<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span> pos<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">define-derived-mode</span> <span style="color: #333333; font-weight: bold;">shen/repl-mode</span> comint-mode <span style="color: #666666;">"shen-repl-mode"</span>
  <span style="color: #333333; font-weight: bold;">:syntax-table</span> shen/syntax-table
  <span style="color: #7388d6;">(</span>setq comint-prompt-regexp shen/repl-prompt-regex<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>setq comint-use-prompt-regexp t<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>setq comint-prompt-read-only t<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>setq comint-input-sender 'shen/repl-input-sender<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>setq-local comment-use-syntax 'undecided<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">unless</span> <span style="color: #909183;">(</span>comint-check-proc <span style="color: #709870;">(</span>current-buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">condition-case</span> nil
        <span style="color: #709870;">(</span>start-process <span style="color: #666666;">"shen/repl"</span> <span style="color: #907373;">(</span>current-buffer<span style="color: #907373;">)</span> <span style="color: #666666;">"cat"</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>file-error <span style="color: #907373;">(</span>start-process <span style="color: #666666;">"shen/repl"</span> <span style="color: #6276ba;">(</span>current-buffer<span style="color: #6276ba;">)</span> <span style="color: #666666;">"hexl"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-process-query-on-exit-flag <span style="color: #709870;">(</span>shen/repl-process<span style="color: #709870;">)</span> nil<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>goto-char <span style="color: #709870;">(</span>point-max<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set <span style="color: #709870;">(</span>make-local-variable 'comint-inhibit-carriage-motion<span style="color: #709870;">)</span> t<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>insert shen/shen.credits<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/repl-set-pm <span style="color: #709870;">(</span>point-max<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>comint-output-filter <span style="color: #709870;">(</span>shen/repl-process<span style="color: #709870;">)</span> <span style="color: #666666;">"(0-) "</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-marker comint-last-input-start <span style="color: #709870;">(</span>shen/repl-pm<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>set-process-filter <span style="color: #709870;">(</span>get-buffer-process <span style="color: #907373;">(</span>current-buffer<span style="color: #907373;">)</span><span style="color: #709870;">)</span> 'comint-output-filter<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defconst</span> <span style="color: #333333;">*shen-repl*</span> <span style="color: #666666;">"*shen-repl*"</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
