melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline65" class="outline-3">
<h3 id="orgheadline65"><span class="section-number-3">9.6</span> Starting the REPL</h3>
<div class="outline-text-3" id="text-9-6">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #d9d9d9;">;;;</span><span style="color: #7f7f7f;">###</span><span style="color: #ff0000; font-weight: bold;">autoload</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/repl</span> nil
  <span style="color: #7388d6;">(</span>interactive<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span>old-point<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">unless</span> <span style="color: #709870;">(</span>get-buffer *shen-repl*<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span> <span style="color: #907373;">(</span>get-buffer-create *shen-repl*<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>make-local-variable 'lexical-binding<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>load <span style="color: #666666;">"shen-primitives.elc"</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>load <span style="color: #666666;">"shen.elc"</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>load <span style="color: #666666;">"shen-overlays.elc"</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/migrate-symbol-table<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>setq lexical-binding 't<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set 'shen.*history* '<span style="color: #6276ba;">()</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set '*home-directory* <span style="color: #666666;">""</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/set 'shen.*tc* 'false<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">unless</span> <span style="color: #6276ba;">(</span>zerop <span style="color: #858580;">(</span>buffer-size<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span> <span style="color: #6276ba;">(</span>setq old-point <span style="color: #858580;">(</span>point<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>shen/repl-mode<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>switch-to-buffer *shen-repl*<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">when</span> old-point <span style="color: #709870;">(</span>push-mark old-point<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgheadline66" class="outline-3">
<h3 id="orgheadline66"><span class="section-number-3">9.7</span> Provide it</h3>
<div class="outline-text-3" id="text-9-7">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">provide</span> '<span style="color: #333333; font-weight: bold;">shen-repl</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline70" class="outline-2">
<h2 id="orgheadline70"><span class="section-number-2">10</span> Bootstrap</h2>
<div class="outline-text-2" id="text-10">
<p>
Bootstrapping a Shen environment involves
</p>
<ol class="org-ol">
<li>collecting all the KLambda files in the "KLambda" directory in this package into a variable</li>
<li>modifying the Elisp reader so it doesn't choke on what it would consider illegal symbols in KLambda</li>
<li>iterating over the KLambda files, parse out and evaluate KLambda s-expressions</li>
<li>providing a runner that kicks off the process</li>
</ol>
</div>
<div id="outline-container-orgheadline67" class="outline-3">
<h3 id="orgheadline67"><span class="section-number-3">10.1</span> Collecting KLambda files</h3>
<div class="outline-text-3" id="text-10-1">
<p>
In order to bootstrap the environment we specify the location of all the KLambda files
that need to be read in and compiled. They are located in the <code>KLambda</code> directory of this
package.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">require</span> '<span style="color: #333333; font-weight: bold;">shen-primitives</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>setq *klambda-directory-name* <span style="color: #666666;">"KLambda"</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>setq *klambda-directory* <span style="color: #7388d6;">(</span>file-name-as-directory <span style="color: #909183;">(</span>concat <span style="color: #709870;">(</span>file-name-directory load-file-name<span style="color: #709870;">)</span> *klambda-directory-name*<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span>setq *klambda-files*
      <span style="color: #7388d6;">(</span>mapcar <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #709870;">(</span>klFile<span style="color: #709870;">)</span> <span style="color: #709870;">(</span>concat *klambda-directory* klFile<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
              '<span style="color: #909183;">(</span><span style="color: #666666;">"toplevel.kl"</span> <span style="color: #666666;">"core.kl"</span> <span style="color: #666666;">"sys.kl"</span> <span style="color: #666666;">"sequent.kl"</span> <span style="color: #666666;">"yacc.kl"</span>
                <span style="color: #666666;">"reader.kl"</span> <span style="color: #666666;">"prolog.kl"</span> <span style="color: #666666;">"track.kl"</span> <span style="color: #666666;">"load.kl"</span> <span style="color: #666666;">"writer.kl"</span>
                <span style="color: #666666;">"macros.kl"</span> <span style="color: #666666;">"declarations.kl"</span> <span style="color: #666666;">"types.kl"</span> <span style="color: #666666;">"t-star.kl"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
In order to read in the KLambda s-expressions using the Elisp reader we need to
make some adjustments due to the differences between KLambda and Elisp.
</p>
</div>
</div>
