melpa/working/shen-elisp/install.el
;; [[file:shen-elisp.org::*Collecting%20KLambda%20files][Collecting\ KLambda\ files:1]]
(require 'shen-primitives)
(setq *klambda-directory-name* "KLambda")
(setq *klambda-directory* (file-name-as-directory (concat (file-name-directory load-file-name) *klambda-directory-name*)))
(setq *klambda-files*
      (mapcar (lambda (klFile) (concat *klambda-directory* klFile))
              '("toplevel.kl" "core.kl" "sys.kl" "sequent.kl" "yacc.kl"
                "reader.kl" "prolog.kl" "track.kl" "load.kl" "writer.kl"
                "macros.kl" "declarations.kl" "types.kl" "t-star.kl")))
;; Collecting\ KLambda\ files:1 ends here
