melpa/working/shen-elisp/shen-repl.el
(defun shen/repl nil
  (interactive)
  (let (old-point)
    (unless (get-buffer *shen-repl*)
      (with-current-buffer (get-buffer-create *shen-repl*)
        (make-local-variable 'lexical-binding)
        (load "shen-primitives.elc")
        (load "shen.elc")
        (load "shen-overlays.elc")
        (shen/migrate-symbol-table)
        (setq lexical-binding 't)
        (shen/set 'shen.*history* '())
        (shen/set '*home-directory* "")
        (shen/set 'shen.*tc* 'false)
        (unless (zerop (buffer-size)) (setq old-point (point)))
        (shen/repl-mode)))
    (switch-to-buffer *shen-repl*)
    (when old-point (push-mark old-point))))
;; Starting\ the\ REPL:1 ends here

;; [[file:shen-elisp.org::*Provide%20it][Provide\ it:1]]
(provide 'shen-repl)
;; Provide\ it:1 ends here
