melpa/working/shen-elisp/shen-elisp.html
<div id="outline-container-orgheadline68" class="outline-3">
<h3 id="orgheadline68"><span class="section-number-3">10.2</span> Modifying The Elisp Reader For KLambda</h3>
<div class="outline-text-3" id="text-10-2">
<p>
In KLambda semicolons, colons, commas, ticks and backquotes are valid symbols. Since they have
different meanings in Elisp they will be rejected by the reader by default so we
need to insert them as regular symbols into a temporary <code>syntax-table</code> and then
parse out the s-expressions.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>setq shen/*klambda-syntax-table*
      <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>table <span style="color: #907373;">(</span>make-syntax-table lisp-mode-syntax-table<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>modify-syntax-entry <span style="color: #333333; font-weight: bold;">59</span> <span style="color: #666666;">"_"</span> table<span style="color: #909183;">)</span> <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">semi-colon</span>
        <span style="color: #909183;">(</span>modify-syntax-entry ?, <span style="color: #666666;">"_"</span> table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>modify-syntax-entry ?# <span style="color: #666666;">"_"</span> table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>modify-syntax-entry ?' <span style="color: #666666;">"_"</span> table<span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>modify-syntax-entry ?` <span style="color: #666666;">"_"</span> table<span style="color: #909183;">)</span>
        table<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/get-klambda-sexp-strings</span> <span style="color: #7388d6;">(</span>klambda-file<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">with-temp-buffer</span>
    <span style="color: #909183;">(</span>insert-file-contents klambda-file<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">with-syntax-table</span> shen/*klambda-syntax-table*
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>klambda-code <span style="color: #858580;">(</span>buffer-string<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>current-sexp-end <span style="color: #858580;">(</span>scan-lists <span style="color: #333333; font-weight: bold;">0</span> <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #333333; font-weight: bold;">0</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
             <span style="color: #6276ba;">(</span>groups nil<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">while</span> current-sexp-end
            <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>current-sexp-start <span style="color: #707183;">(</span>scan-lists current-sexp-end <span style="color: #333333; font-weight: bold;">-1</span> <span style="color: #333333; font-weight: bold;">0</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
              <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                <span style="color: #887070;">(</span>setq groups <span style="color: #707183;">(</span>nconc groups <span style="color: #7388d6;">(</span>list <span style="color: #909183;">(</span>buffer-substring current-sexp-start current-sexp-end<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span>setq current-sexp-end <span style="color: #707183;">(</span>scan-lists current-sexp-end <span style="color: #333333; font-weight: bold;">1</span> <span style="color: #333333; font-weight: bold;">0</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          groups<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Even though simply changing the syntax table works for parsing the s-expressions
as strings, the Elisp reader will still choke on illegal characters.
</p>

<p>
Each of those forbidden characters is encoded as a string that is unlikely to
occur in the normal course of events (hopefully). The name of the character is
interleaved with its reverse and prefixed an <code>_</code>. So, for example, <code>#</code> , spelled
"hash" becomes "_hhassahh" which is the interleaving of "hash" and "hsah" with a
leading underscore.
</p>

<p>
The mappings are stored in an alist and forward and reverse lookup functions are
provided
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>setq shen/*illegal-character-&gt;spelling*
      '<span style="color: #7388d6;">(</span><span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">59</span> <span style="color: #666666;">"_sneomlioccoilmoens"</span><span style="color: #909183;">)</span>  <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">semicolon</span>
        <span style="color: #909183;">(</span>?, <span style="color: #666666;">"_caommmmoac"</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">35</span> <span style="color: #666666;">"_hhassshh"</span><span style="color: #909183;">)</span>            <span style="color: #d9d9d9;">;; </span><span style="color: #7f7f7f;">hash</span>
        <span style="color: #909183;">(</span>?' <span style="color: #666666;">"_tkiccikt"</span><span style="color: #909183;">)</span>
        <span style="color: #909183;">(</span>?` <span style="color: #666666;">"_beatcokuqqukoctaeb"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>

<span style="color: #707183;">(</span>setq shen/*spelling-&gt;illegal-character*
      <span style="color: #7388d6;">(</span>mapcar #'reverse shen/*illegal-character-&gt;spelling*<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>


<p>
With the mapping in place the klambda s-expressions can be sanitized for the Elisp reader:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/remove-reserved-elisp-characters</span> <span style="color: #7388d6;">(</span>klambda-sexp-string<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>InString nil<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>illegal-characters
         <span style="color: #907373;">(</span>mapcar
          <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #858580;">(</span>char-&gt;spelling<span style="color: #858580;">)</span> <span style="color: #858580;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> char-&gt;spelling<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
          shen/*illegal-character-&gt;spelling*<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>res<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>curr klambda-sexp-string<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">cl-flet</span> <span style="color: #709870;">(</span><span style="color: #907373;">(</span>append-and-advance
               <span style="color: #6276ba;">(</span><span style="color: #333333; font-style: italic;">&amp;optional</span> X<span style="color: #6276ba;">)</span>
               <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                 <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> X <span style="color: #80a880;">(</span>setq res <span style="color: #887070;">(</span>concat res X<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                   <span style="color: #80a880;">(</span>setq res <span style="color: #887070;">(</span>concat res <span style="color: #707183;">(</span>substring curr <span style="color: #333333; font-weight: bold;">0</span> <span style="color: #333333; font-weight: bold;">1</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                 <span style="color: #858580;">(</span>setq curr <span style="color: #80a880;">(</span>substring curr <span style="color: #333333; font-weight: bold;">1</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #907373;">(</span>not <span style="color: #6276ba;">(</span>= <span style="color: #333333; font-weight: bold;">0</span> <span style="color: #858580;">(</span>length curr<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
         <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>char-equal <span style="color: #80a880;">(</span>string-to-char curr<span style="color: #80a880;">)</span> ?\"<span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> InString
              <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
                <span style="color: #887070;">(</span>setq InString nil<span style="color: #887070;">)</span>
                <span style="color: #887070;">(</span>append-and-advance<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
            <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
              <span style="color: #887070;">(</span>setq InString 't<span style="color: #887070;">)</span>
              <span style="color: #887070;">(</span>append-and-advance<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
         <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>memq <span style="color: #80a880;">(</span>string-to-char curr<span style="color: #80a880;">)</span> illegal-characters<span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> InString
              <span style="color: #80a880;">(</span>append-and-advance<span style="color: #80a880;">)</span>
            <span style="color: #80a880;">(</span>append-and-advance
             <span style="color: #887070;">(</span>car <span style="color: #707183;">(</span>assoc-default
                   <span style="color: #7388d6;">(</span>string-to-char curr<span style="color: #7388d6;">)</span>
                   shen/*illegal-character-&gt;spelling*<span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
         <span style="color: #6276ba;">(</span>t <span style="color: #858580;">(</span>append-and-advance<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      res<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
Once the reader has accepted the s-expression, the symbols need to be switched back to their
original spellings:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/put-reserved-elisp-chars-back</span> <span style="color: #7388d6;">(</span>sexp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>symbols <span style="color: #907373;">(</span>shen/find-symbols sexp<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/internal/modify-ast sexp
                     symbols
                     <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #907373;">(</span>path ast<span style="color: #907373;">)</span>
                       <span style="color: #907373;">(</span>shen/change-back <span style="color: #6276ba;">(</span>shen/internal/get-element-at path ast<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
To do so we need a function that iterates over a symbols and replaces the sanitized
spelling with the original character:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/change-back</span> <span style="color: #7388d6;">(</span>symbol<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let*</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>original-length <span style="color: #907373;">(</span>length <span style="color: #6276ba;">(</span>symbol-name symbol<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>string-left <span style="color: #907373;">(</span>symbol-name symbol<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>spelling-&gt;character
          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #6276ba;">(</span><span style="color: #858580;">(</span>hash <span style="color: #80a880;">(</span>make-hash-table<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span>mapcar <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #80a880;">(</span>spelling-character<span style="color: #80a880;">)</span>
                      <span style="color: #80a880;">(</span>puthash <span style="color: #887070;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> spelling-character<span style="color: #887070;">)</span> <span style="color: #887070;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> spelling-character<span style="color: #887070;">)</span> hash<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
                    shen/*spelling-&gt;illegal-character*<span style="color: #6276ba;">)</span>
            hash<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>spellings <span style="color: #907373;">(</span>hash-table-keys spelling-&gt;character<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>get-character-and-remaining
          <span style="color: #907373;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #6276ba;">(</span>S<span style="color: #6276ba;">)</span>
            <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>found-at-index <span style="color: #887070;">(</span>shen/internal/index-of <span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">lambda</span> <span style="color: #7388d6;">(</span>spelling<span style="color: #7388d6;">)</span> <span style="color: #7388d6;">(</span>string-prefix-p spelling S<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span> spellings<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
              <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">if</span> found-at-index
                  <span style="color: #80a880;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #887070;">(</span><span style="color: #707183;">(</span>spelling <span style="color: #7388d6;">(</span>nth found-at-index spellings<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                    <span style="color: #887070;">(</span>list <span style="color: #707183;">(</span>string <span style="color: #7388d6;">(</span>gethash spelling spelling-&gt;character<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
                          <span style="color: #707183;">(</span>substring S <span style="color: #7388d6;">(</span>length spelling<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
                <span style="color: #80a880;">(</span>list <span style="color: #887070;">(</span>string <span style="color: #707183;">(</span>aref S <span style="color: #333333; font-weight: bold;">0</span><span style="color: #707183;">)</span><span style="color: #887070;">)</span>
                      <span style="color: #887070;">(</span>substring S <span style="color: #333333; font-weight: bold;">1</span><span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
         <span style="color: #709870;">(</span>reversed-result<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #709870;">(</span>&gt; <span style="color: #907373;">(</span>length string-left<span style="color: #907373;">)</span> <span style="color: #333333; font-weight: bold;">0</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>character-and-remaining <span style="color: #858580;">(</span>funcall get-character-and-remaining string-left<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>push <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">0</span> character-and-remaining<span style="color: #6276ba;">)</span> reversed-result<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>setq string-left <span style="color: #6276ba;">(</span>nth <span style="color: #333333; font-weight: bold;">1</span> character-and-remaining<span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>intern <span style="color: #709870;">(</span>apply #'concat <span style="color: #907373;">(</span>reverse reversed-result<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>

<p>
And a function that collects paths to all symbols in an s-expression:
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">shen/find-symbols</span> <span style="color: #7388d6;">(</span>sexp<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>symbols<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-path<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-list sexp<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-list-length <span style="color: #907373;">(</span>length sexp<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>current-index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>locally-scoped-symbols<span style="color: #709870;">)</span>
        <span style="color: #709870;">(</span>inner-lists<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">while</span> <span style="color: #709870;">(</span>or <span style="color: #907373;">(</span>&lt; current-index current-list-length<span style="color: #907373;">)</span>
               inner-lists<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
       <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>and <span style="color: #858580;">(</span>= current-index current-list-length<span style="color: #858580;">)</span> inner-lists<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
          <span style="color: #858580;">(</span>setq current-path <span style="color: #80a880;">(</span>car inner-lists<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span>setq inner-lists <span style="color: #80a880;">(</span>cdr inner-lists<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span>setq current-list <span style="color: #80a880;">(</span>shen/internal/get-element-at current-path sexp<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span>setq current-index <span style="color: #333333; font-weight: bold;">0</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span>setq current-list-length <span style="color: #80a880;">(</span>length current-list<span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span><span style="color: #6276ba;">(</span>&lt; current-index current-list-length<span style="color: #6276ba;">)</span>
        <span style="color: #6276ba;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #858580;">(</span><span style="color: #80a880;">(</span>current-token <span style="color: #887070;">(</span>nth current-index current-list<span style="color: #887070;">)</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span><span style="color: #333333; font-weight: bold;">cond</span>
           <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>symbolp current-token<span style="color: #887070;">)</span>
            <span style="color: #887070;">(</span>push <span style="color: #707183;">(</span>cons current-index current-path<span style="color: #707183;">)</span> symbols<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
           <span style="color: #80a880;">(</span><span style="color: #887070;">(</span>consp current-token<span style="color: #887070;">)</span>
            <span style="color: #887070;">(</span>push <span style="color: #707183;">(</span>cons current-index current-path<span style="color: #707183;">)</span>
                  inner-lists<span style="color: #887070;">)</span><span style="color: #80a880;">)</span>
           <span style="color: #80a880;">(</span>t nil<span style="color: #80a880;">)</span><span style="color: #858580;">)</span>
          <span style="color: #858580;">(</span>setq current-index <span style="color: #80a880;">(</span>+ current-index <span style="color: #333333; font-weight: bold;">1</span><span style="color: #80a880;">)</span><span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span>
       <span style="color: #907373;">(</span>t nil<span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    symbols<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
