melpa/working/shen-elisp/shen-elisp.html

<div id="outline-container-orgheadline69" class="outline-3">
<h3 id="orgheadline69"><span class="section-number-3">10.3</span> Iterating over KLambda Files</h3>
<div class="outline-text-3" id="text-10-3">
<p>
Now we can finally collect, and parse all the s-expressions in the
KLambda files and then pass the result to <code>shen/eval-kl</code> to transform
KLambda code into Elisp.
</p>
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span>setq *temp-shen-buffer*
      <span style="color: #7388d6;">(</span>find-file-noselect
       <span style="color: #909183;">(</span>concat <span style="color: #709870;">(</span>file-name-as-directory default-directory<span style="color: #709870;">)</span>
               <span style="color: #709870;">(</span>file-relative-name <span style="color: #666666;">"shen.el"</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">eval-klambda-files</span> <span style="color: #7388d6;">(</span>klambda-files<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">with-current-buffer</span> *temp-shen-buffer*
    <span style="color: #909183;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
      <span style="color: #709870;">(</span>erase-buffer<span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">";; -*- lexical-binding: t -*- "</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">";; Local Variables&#58;"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">";; byte-compile-warnings: (not redefine callargs free-vars unresolved obsolete noruntime cl-functions interactive-only make-local mapcar constants suspicious lexical)"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">";; End:"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">"(require 'shen-primitives)"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">"(setq max-lisp-eval-depth 60000)"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">"(setq max-specpdl-size 13000)"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #907373;">(</span>klambda-file klambda-files nil<span style="color: #907373;">)</span>
        <span style="color: #907373;">(</span>eval-klambda-file klambda-file<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>goto-char <span style="color: #907373;">(</span>point-max<span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>insert <span style="color: #907373;">(</span>format <span style="color: #666666;">"%s\n"</span> <span style="color: #666666;">"(provide 'shen)"</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span>
      <span style="color: #709870;">(</span>save-buffer<span style="color: #709870;">)</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">eval-klambda-file</span> <span style="color: #7388d6;">(</span>klambda-file<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">dolist</span> <span style="color: #909183;">(</span>klambda-sexp-string <span style="color: #709870;">(</span>shen/get-klambda-sexp-strings klambda-file<span style="color: #709870;">)</span> nil<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval-klambda-sexp-string klambda-sexp-string<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">eval-klambda-sexp-string</span> <span style="color: #7388d6;">(</span>klambda-sexp-string<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">let</span> <span style="color: #909183;">(</span><span style="color: #709870;">(</span>ast <span style="color: #907373;">(</span>shen/put-reserved-elisp-chars-back
              <span style="color: #6276ba;">(</span>read
               <span style="color: #858580;">(</span>shen/remove-reserved-elisp-characters
                klambda-sexp-string<span style="color: #858580;">)</span><span style="color: #6276ba;">)</span><span style="color: #907373;">)</span><span style="color: #709870;">)</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/kl-to-buffer ast *temp-shen-buffer*<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgheadline71" class="outline-2">
<h2 id="orgheadline71"><span class="section-number-2">11</span> The Runner</h2>
<div class="outline-text-2" id="text-11">
<div class="org-src-container">

<pre class="src src-elisp"><span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">compile-and-load</span> <span style="color: #7388d6;">(</span>F<span style="color: #7388d6;">)</span>
  <span style="color: #7388d6;">(</span>byte-compile-file
   <span style="color: #909183;">(</span>concat <span style="color: #709870;">(</span>file-name-as-directory default-directory<span style="color: #709870;">)</span>
           <span style="color: #709870;">(</span>file-relative-name F<span style="color: #709870;">)</span><span style="color: #909183;">)</span>
   't<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">load-klambda</span> <span style="color: #7388d6;">()</span> <span style="color: #7388d6;">(</span>eval-klambda-files *klambda-files*<span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">load-only</span> <span style="color: #7388d6;">()</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"shen-primitives.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"install.el"</span><span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
<span style="color: #707183;">(</span><span style="color: #333333; font-weight: bold;">defun</span> <span style="color: #333333; font-weight: bold;">runner</span> <span style="color: #7388d6;">()</span>
  <span style="color: #7388d6;">(</span><span style="color: #333333; font-weight: bold;">progn</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"shen-primitives.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"install.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>eval-klambda-files *klambda-files*<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"shen.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"shen-overlays.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>compile-and-load <span style="color: #666666;">"shen-repl.el"</span><span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>add-to-load-path default-directory<span style="color: #909183;">)</span>
    <span style="color: #909183;">(</span>shen/repl<span style="color: #909183;">)</span><span style="color: #7388d6;">)</span><span style="color: #707183;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Aditya Siram</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
