melpa/working/shen-elisp/install.el

;; [[file:shen-elisp.org::*Iterating%20over%20KLambda%20Files][Iterating\ over\ KLambda\ Files:1]]
(setq *temp-shen-buffer*
      (find-file-noselect
       (concat (file-name-as-directory default-directory)
               (file-relative-name "shen.el"))))
(defun eval-klambda-files (klambda-files)
  (with-current-buffer *temp-shen-buffer*
    (progn
      (erase-buffer)
      (insert (format "%s\n" ";; -*- lexical-binding: t -*- "))
      (insert (format "%s\n" ";; Local Variables:"))
      (insert (format "%s\n" ";; byte-compile-warnings: (not redefine callargs free-vars unresolved obsolete noruntime cl-functions interactive-only make-local mapcar constants suspicious lexical)"))
      (insert (format "%s\n" ";; End:"))
      (insert (format "%s\n" "(require 'shen-primitives)"))
      (insert (format "%s\n" "(setq max-lisp-eval-depth 60000)"))
      (insert (format "%s\n" "(setq max-specpdl-size 13000)"))
      (goto-char (point-max))
      (dolist (klambda-file klambda-files nil)
        (eval-klambda-file klambda-file))
      (goto-char (point-max))
      (insert (format "%s\n" "(provide 'shen)"))
      (save-buffer))))
(defun eval-klambda-file (klambda-file)
  (dolist (klambda-sexp-string (shen/get-klambda-sexp-strings klambda-file) nil)
    (eval-klambda-sexp-string klambda-sexp-string)))
(defun eval-klambda-sexp-string (klambda-sexp-string)
  (let ((ast (shen/put-reserved-elisp-chars-back
              (read
               (shen/remove-reserved-elisp-characters
                klambda-sexp-string)))))
    (shen/kl-to-buffer ast *temp-shen-buffer*)))
;; Iterating\ over\ KLambda\ Files:1 ends here

;; [[file:shen-elisp.org::*The%20Runner][The\ Runner:1]]
(defun compile-and-load (F)
  (byte-compile-file
   (concat (file-name-as-directory default-directory)
           (file-relative-name F))
   't))
(defun load-klambda () (eval-klambda-files *klambda-files*))
(defun load-only ()
  (progn
    (compile-and-load "shen-primitives.el")
    (compile-and-load "install.el")))
(defun runner ()
  (progn
    (compile-and-load "shen-primitives.el")
    (compile-and-load "install.el")
    (eval-klambda-files *klambda-files*)
    (compile-and-load "shen.el")
    (compile-and-load "shen-overlays.el")
    (compile-and-load "shen-repl.el")
    (add-to-load-path default-directory)
    (shen/repl)))
;; The\ Runner:1 ends here
